<!DOCTYPE html>
<html>
    <head>
        <title>Cudos Trail : Korrespondenz Bewerber &amp; Studenten</title>
        <link rel="stylesheet" href="styles/site.css" type="text/css" />
        <META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    </head>

    <body class="theme-default aui-theme-default">
        <div id="page">
            <div id="main" class="aui-page-panel">
                <div id="main-header">
                    <div id="breadcrumb-section">
                        <ol id="breadcrumbs">
                            <li class="first">
                                <span><a href="index.html">Cudos Trail</a></span>
                            </li>
                                                    <li>
                                <span><a href="Cudos-Trail-Startseite_5639668934.html">Cudos Trail Startseite</a></span>
                            </li>
                                                </ol>
                    </div>
                    <h1 id="title-heading" class="pagetitle">
                                                <span id="title-text">
                            Cudos Trail : Korrespondenz Bewerber &amp; Studenten
                        </span>
                    </h1>
                </div>

                <div id="content" class="view">
                    <div class="page-metadata">
                        
        
    
        
    
        
        
            Created by <span class='author'> Rachel Blaser</span>, last modified on Nov. 15, 2023
                        </div>
                    <div id="main-content" class="wiki-content group">
                    <style type="text/css">/*<![CDATA[*/
div.rbtoc1728986661590 {padding: 0px;}
div.rbtoc1728986661590 ul {list-style: disc;margin-left: 0px;}
div.rbtoc1728986661590 li {margin-left: 0px;padding-left: 0px;}

/*]]>*/</style><div class="toc-macro rbtoc1728986661590"><style>[data-colorid=pjltof3jjk]{color:#1b1f29} html[data-color-mode=dark] [data-colorid=pjltof3jjk]{color:#d6dae4}[data-colorid=m870o69eb7]{color:#222222} html[data-color-mode=dark] [data-colorid=m870o69eb7]{color:#dddddd}[data-colorid=uel2aoqy3i]{color:#222222} html[data-color-mode=dark] [data-colorid=uel2aoqy3i]{color:#dddddd}[data-colorid=b9mwk6de8p]{color:#222222} html[data-color-mode=dark] [data-colorid=b9mwk6de8p]{color:#dddddd}[data-colorid=mi9a7ovx98]{color:#222222} html[data-color-mode=dark] [data-colorid=mi9a7ovx98]{color:#dddddd}[data-colorid=osqyvb5kqy]{color:#1b1f29} html[data-color-mode=dark] [data-colorid=osqyvb5kqy]{color:#d6dae4}[data-colorid=xlut6rbzj8]{color:#222222} html[data-color-mode=dark] [data-colorid=xlut6rbzj8]{color:#dddddd}[data-colorid=z5la6m5i2g]{color:#222222} html[data-color-mode=dark] [data-colorid=z5la6m5i2g]{color:#dddddd}[data-colorid=oe8odycwzw]{color:#222222} html[data-color-mode=dark] [data-colorid=oe8odycwzw]{color:#dddddd}[data-colorid=e5436t0t47]{color:#222222} html[data-color-mode=dark] [data-colorid=e5436t0t47]{color:#dddddd}[data-colorid=s7u5gztjm3]{color:#222222} html[data-color-mode=dark] [data-colorid=s7u5gztjm3]{color:#dddddd}</style>
<ul class="toc-indentation">
<li><a href="#KorrespondenzBewerber&amp;Studenten-1.EinladunganJobmesse">1. Einladung an Jobmesse</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-2.EinladungInfo-Anlass">2. Einladung Info-Anlass</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-3.KontaktausCV-Datenbank">3. Kontakt aus CV-Datenbank</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-4.nachInfo-Anlass">4. nach Info-Anlass</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-5.R체ckfrageBewerbung">5. R&uuml;ckfrage Bewerbung</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-6.Bewerbungsbest채tigung/EinladungCodility">6. Bewerbungsbest&auml;tigung / Einladung Codility</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-7.Einladung1.Interview">7. Einladung 1. Interview</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-8.Einladung2.Interview">8. Einladung 2. Interview</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-9.Absage">9. Absage</a>
<ul class="toc-indentation">
<li><a href="#KorrespondenzBewerber&amp;Studenten-9.1direkteAbsage">9.1 direkte Absage</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-9.2AbsagenachCodility">9.2 Absage nach Codility</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-9.3Absagenach1.Interview">9.3 Absage nach 1. Interview</a></li>
<li><a href="#KorrespondenzBewerber&amp;Studenten-9.4Absagenach2.Interview">9.4 Absage nach 2. Interview</a></li>
</ul>
</li>
</ul>
</div><p><br /></p><h1 id="KorrespondenzBewerber&amp;Studenten-1.EinladunganJobmesse">1.&nbsp;&nbsp;&nbsp;&nbsp; Einladung an Jobmesse</h1><p>Bist du diesen Mittwoch, 10. Mai 2017 ebenfalls am&nbsp;<a class="external-link" href="https://www.m-f.ch/events/event/0/21-jobmessen/20-career-day-fhnw" rel="nofollow">Career Day der FHNW</a>?&nbsp;</p><p>Wir sind wie jedes Jahr mit einem Stand vor Ort und w&uuml;rden uns sehr &uuml;ber deinen Besuch freuen! Bei uns am&nbsp;<strong>Stand-Nr. 19</strong>&nbsp;erf&auml;hrst du alles &uuml;ber unser&nbsp;<a class="external-link" href="https://www.m-f.ch/kompetenzen#JUMP3" rel="nofollow">Software Trainee-Programm</a>&nbsp;und kannst dich direkt mit unseren Trainees austauschen.&nbsp;</p><p>Falls du keine Zeit hast und trotzdem mehr &uuml;ber unser Trainee-Programm erfahren m&ouml;chtest, kannst du auch gerne an einen unserer&nbsp;<a class="external-link" href="https://www.m-f.ch/component/k2/30-info-trainee-programm" rel="nofollow">Info-Anl&auml;sse</a>&nbsp;kommen.&nbsp;</p><p>Ich w&uuml;nsch dir einen sch&ouml;nen Tag und hoffentlich bis am Mittwoch!</p><p>Freundliche Gr&uuml;sse</p><hr /><p>In der CV-Cloud der BFH wurde ich auf dich aufmerksam und nun m&ouml;chte ich dich auf uns aufmerksam machen, falls du uns noch nicht kennst.</p><p>Wir sind ein&nbsp;<strong>Schweizer Engineering-Unternehmen</strong>&nbsp;mit &uuml;ber&nbsp;<strong>30 Jahren Erfahrung</strong>&nbsp;in den Bereichen&nbsp;<strong>Software-Entwicklung</strong>, automatisiertes Testen und Pr&uuml;fsysteme. Ein spezielles Augenmerk richten wir jedoch auf die F&ouml;rderung von Top-Studienabg&auml;ngern.&nbsp;</p><p>M&amp;F bietet Studienabg&auml;ngern ein attraktives&nbsp;<a class="external-link" href="https://www.m-f.ch/kompetenzen#JUMP3" rel="nofollow"><strong>Software&nbsp;Trainee-Programm</strong></a>, um sich innerhalb von drei Jahren gezielt zu Top Software-Entwicklern mit breiter Erfahrung zu entwickeln. Die Trainees arbeiten dabei jeweils 6 oder 12 Monate in einer unserer Partnerfirmen in spannenden Software-Projekten mit. Paralleles professionelles Coaching und monatliche Workshops unterst&uuml;tzen die Weiterbildung. Mehr dazu findest du auf unserer Website:&nbsp;<a class="external-link" href="https://www.m-f.ch/" rel="nofollow">www.m-f.ch</a>&nbsp;oder im Flyer anbei.</p><p>Interessiert? Komm doch am&nbsp;<strong>Dienstag an unserem Stand 5.11 am&nbsp;</strong><a class="external-link" href="https://www.m-f.ch/events/event/0/21-jobmessen/22-bfh-career-day" rel="nofollow"><strong>Career Day</strong></a>&nbsp;vorbei und wir erz&auml;hlen dir mehr davon!&nbsp;</p><p>Falls du nicht am Career Day teilnehmen kannst und dich trotzdem f&uuml;rs Trainee-Programm interessierst, schreib mir einfach.&nbsp;</p><hr /><p>Auf der CV-Datenbank der FHB wurde ich auf dich aufmerksam und m&ouml;chte dich nun auf uns aufmerksam machen, falls du uns noch nicht kennst. :-)</p><p>Wir sind ein&nbsp;<strong>Schweizer Engineering-Unternehmen</strong>&nbsp;mit &uuml;ber&nbsp;<strong>30 Jahren Erfahrung</strong>&nbsp;in den Bereichen&nbsp;<strong>Software-Entwicklung</strong>, automatisiertes Testen und Pr&uuml;fsysteme. Ein spezielles Augenmerk richten wir jedoch auf die F&ouml;rderung von Top-Studienabg&auml;ngern.&nbsp;M&amp;F bietet Studienabg&auml;ngern ein attraktives&nbsp;<strong>Trainee-Programm</strong>, um sich innerhalb von drei Jahren gezielt zu Top Software-Entwicklern mit breiter Erfahrung zu entwickeln. Die Trainees arbeiten dabei jeweils 6 oder 12 Monate in einer unserer Partnerfirmen in spannenden Software-Projekten mit. Paralleles professionelles Coaching und monatliche Workshops unterst&uuml;tzen die Weiterbildung.&nbsp;</p><p>Interessiert? Komm doch morgen am&nbsp;<strong>Career Day</strong>&nbsp;in Biel an unserem&nbsp;<strong>Stand 5.6</strong>&nbsp;im Zimmer 5.03 vorbei und wir erz&auml;hlen dir mehr davon!</p><p>Falls du&nbsp;nicht&nbsp;am Career Day teilnehmen kannst und dich trotzdem f&uuml;rs Trainee Programm interessierst, schreib uns einfach. Bei Fragen kannst du mich ebenfalls gerne kontaktieren.</p><hr /><p><span data-colorid="osqyvb5kqy">Post:</span></p><p><span data-colorid="pjltof3jjk">Studium abgeschlossen, aber keine Lust dich gleich festzulegen? Wir sind ein Netzwerk von &uuml;ber 20 Partnerfirmen und rekrutieren gemeinsam die besten Absolventen. Bei uns hast du monatliche Workshops, ein pers&ouml;nliches Mentoring, 80'000 Sal&auml;r, anspruchsvolle Projekte und lernst alle 6-12 Monate eine neue Firma kennen. Komm vorbei am Stand XY.</span></p><p><br /></p><h1 id="KorrespondenzBewerber&amp;Studenten-2.EinladungInfo-Anlass">2.&nbsp;&nbsp;&nbsp;&nbsp; Einladung Info-Anlass</h1><p>Hallo</p><p>Es hat uns sehr gefreut, dich gestern am Absolvententag kennen zu lernen und mit dir &uuml;ber unser firmen&uuml;bergreifendes&nbsp;<a class="external-link" href="https://www.m-f.ch/kompetenzen/trainee-programm" rel="nofollow">Software Trainee-Programm</a>&nbsp;zu sprechen.</p><p>Gerne laden wir dich zum<strong>&nbsp;Info-Anlass&nbsp;am Dienstag, 10. M&auml;rz&nbsp;</strong>ein. Da erf&auml;hrst du aus erster Hand alles &uuml;ber das Trainee-Programm, die Anforderungen, unsere Partnerfirmen und deren spannenden Software-Projekte.&nbsp;<span data-colorid="uel2aoqy3i">Die Trainees sind selbst vor Ort und beantworten dir gerne all deine Fragen.</span></p><p>Anmelden kannst du dich bei mir per Mail oder &uuml;ber unsere Website:&nbsp;</p><p><a class="external-link" href="https://www.m-f.ch/events/event/14-info-trainee-programm/68-info-anlass-trainee-programm" rel="nofollow"><strong>Dienstag, 10. M&auml;rz von 17.00 bis 19.30 Uhr</strong></a><strong>&nbsp;</strong>(ACHTUNG: Die Anzahl Pl&auml;tze sind beschr&auml;nkt!)</p><p>Sollte dir der Termin nicht passen, dann lass es mich wissen. Selbstverst&auml;ndlich kannst du dich jederzeit bei uns bewerben, auch ohne an einem&nbsp;Info-Anlass&nbsp;teilgenommen zu haben.&nbsp; Wenn du Fragen hast, melde dich ungeniert bei mir.&nbsp;</p><p>Ich w&uuml;nsch dir einen sch&ouml;nen Tag und hoffentlich bis bald!</p><p>Beste Gr&uuml;sse Rachel</p><hr /><p>Hallo,</p><p>Gerne laden wir dich zum<strong>&nbsp;Info-Anlass unseres&nbsp;</strong><a class="external-link" href="https://www.m-f.ch/kompetenzen#JUMP3" rel="nofollow"><strong>Software Trainee-Programms</strong></a><strong>&nbsp;inkl. Pizzaessen</strong>&nbsp;ein. Da erf&auml;hrst du von unseren Trainees alles &uuml;ber deren spannenden Projekte und kannst dich mit ihnen austauschen. An der anschliessenden Firmenf&uuml;hrung wirst du Gelegenheit haben, unsere Firma, unsere Mitarbeiter und die vielf&auml;ltigen Projekte einer Engineeringfirma kennen zu lernen.</p><p>An folgenden Daten werden wir die n&auml;chsten Info-Anl&auml;sse durchf&uuml;hren:</p><ul><li><p><a class="external-link" href="https://www.m-f.ch/events/event/0/14-info-trainee-programm/14-1705-info-tp" rel="nofollow"><strong>Freitag, 12. Mai von 17:00 - 19:15</strong></a></p></li><li><p><a class="external-link" href="https://www.m-f.ch/events/event/0/14-info-trainee-programm/24-1703-info-tp" rel="nofollow"><strong>Mittwoch, 7. Juni von 17:00 - 19:15</strong></a></p></li></ul><p>Es w&uuml;rde uns freuen, dich an einem dieser Daten bei uns in Fahrweid begr&uuml;ssen zu d&uuml;rfen. Du erreichst uns zu Fuss innert 10 Min ab Bahnhof Dietikon oder per Auto (wir haben gen&uuml;gend Parkpl&auml;tze).&nbsp;<strong>Anmelden kannst du dich bei mir via Mail oder &uuml;ber unsere Website:&nbsp;</strong><a class="external-link" href="https://www.m-f.ch/events" rel="nofollow"><strong>https://www.m-f.ch/events</strong></a><strong>.</strong></p><p>Sollten dir obige Termine nicht m&ouml;glich sein, dann lass es uns wissen. Selbstverst&auml;ndlich kannst du dich jederzeit f&uuml;r das Trainee-Programm bewerben, auch ohne an einem Info-Anlass teilgenommen zu haben.&nbsp;</p><p>Verpasse keinen Event und folge uns auf&nbsp;<a class="external-link" href="https://www.linkedin.com/company-beta/10880795/" rel="nofollow">Linkedin&nbsp;</a>oder&nbsp;<a class="external-link" href="https://www.xing.com/companies/m%26fengineeringag" rel="nofollow">XING</a>!</p><p><br /></p><h1 id="KorrespondenzBewerber&amp;Studenten-3.KontaktausCV-Datenbank">3.&nbsp;&nbsp;&nbsp;&nbsp; Kontakt aus CV-Datenbank</h1><p>Hallo Linda</p><p>Auf der CV-Datenbank der ZHAW wurde ich auf dich aufmerksam und nun m&ouml;chte ich dich auf uns aufmerksam machen, falls du uns noch nicht kennst.</p><p>M&amp;F Engineering ist der Industrie 4.0 Spezialist f&uuml;r kompetente Software-Entwicklung und massgeschneiderte Pr&uuml;fsysteme. Zudem bieten wir ein schweizweit einzigartiges Software Trainee-Programm, welches innovative Technologiefirmen und junge Software-Ingenieure zusammenbringt.</p><p>F&uuml;r Hochschulabsolventen ist unser firmen&uuml;bergreifendes Trainee-Programm der ideale Berufseinstieg und macht dich zum gesuchten Software-Experten mit breitem Know-how, viel Erfahrung und grossem Netzwerk. Weitere Informationen zum Trainee-Programm sowie unser neuer Trainee-Film findest du unter:&nbsp;<a class="external-link" href="https://www.m-f.ch/kompetenzen/trainee-programm" rel="nofollow">www.m-f.ch/kompetenzen/trainee-programm</a>.</p><p>Klingt interessant? Dann komm doch diesen Donnerstag, 27. September 2018 um 17.00 Uhr an unseren&nbsp;<a class="external-link" href="https://www.m-f.ch/events/info-veranstaltungen/event/14-info-trainee-programm/44-info-anlass-trainee-programm" rel="nofollow">Info-Anlass</a>&nbsp;inkl. Pizza-Essen mit unseren Trainees. Da erf&auml;hrst du aus erster Hand alles &uuml;ber deren spannenden Projekte und kannst dich direkt mit den Trainees austauschen. An der Firmenf&uuml;hrung wirst du Gelegenheit haben, unsere Firma, unsere Mitarbeiter und die vielf&auml;ltigen Projekte einer Engineeringfirma kennen zu lernen.</p><p>Anmelden kannst du dich bei mir via Mail oder &uuml;ber unsere Website:&nbsp;<a class="external-link" href="https://www.m-f.ch/events" rel="nofollow">www.m-f.ch/events</a>.</p><p>Sollte dir der obige Termin nicht m&ouml;glich sein oder m&ouml;chtest du erst zu einem sp&auml;teren Zeitpunkt teilnehmen, dann lass es mich wissen. Selbstverst&auml;ndlich kannst du dich jederzeit f&uuml;r das Trainee-Programm bewerben, auch ohne an einem Info-Anlass teilgenommen zu haben.&nbsp;</p><p>Beste Gr&uuml;sse und hoffentlich bis bald,</p><p>Rachel</p><hr /><p>Hallo XY,</p><p>Ich habe deine Kontaktangaben aus der CV-Datenbank der BFH.&nbsp;</p><p>Wir sind ein Software-Dienstleister und bieten jungen und motivierten Leuten, die nach ihrem Studium in die Software-Entwicklung einsteigen m&ouml;chten, ein einzigartiges Software Trainee-Programm an. Nun w&uuml;rde ich gerne von dir wissen, ob du gerne im Bereich der Software-Entwicklung arbeiten w&uuml;rdest und noch keine passende Stelle gefunden hast?</p><p>Falls du beide Fragen mit Ja beantworten kannst, dann melde dich doch bei mir und ich erz&auml;hle dir gerne mehr dazu. Anbei sende ich dir unseren Flyer zum Trainee-Programm, sodass du dir schon mal einen Eindruck verschaffen kannst.</p><p>Ich w&uuml;rde mich freuen, von dir zu h&ouml;ren!</p><p /><h1 id="KorrespondenzBewerber&amp;Studenten-4.nachInfo-Anlass">4.&nbsp;&nbsp;&nbsp;&nbsp; nach Info-Anlass</h1><p>Liebe XY<br />Es hat uns sehr gefreut, dass du gestern bei uns am Info-Anlass warst. Ich hoffe, der Anlass hat dir gefallen und du konntest dir ein gutes Bild &uuml;ber M&amp;F Engineering und unser Trainee-Programm verschaffen.&nbsp;&nbsp;</p><p>Alle Informationen bez&uuml;glich Anforderungen und Vorbereitungen f&uuml;rs Trainee-Programm inkl. B&uuml;cher-Tipps findest du auf folgendem&nbsp;<a class="external-link" href="https://www.m-f.ch/blog/softwareentwicklung-fuer-elektroingenieure" rel="nofollow">Blog-Beitrag</a>. Zudem ist die Brosch&uuml;re mit allen Partnerfirmen ebenfalls online als&nbsp;<a class="external-link" href="https://www.m-f.ch/images/MF-Partnerfirmen-min.pdf" rel="nofollow">PDF</a>&nbsp;verf&uuml;gbar.</p><p>Falls du noch irgendwelche Fragen hast, kannst du dich jederzeit bei mir melden. Ansonsten freue ich mich, wieder von dir zu h&ouml;ren und dich vielleicht schon bald an einem Interview bei uns zu sehen. :-)</p><p>Ich w&uuml;nsche dir einen sch&ouml;nen Tag und viele Gr&uuml;sse Rachel<br /></p><h1 id="KorrespondenzBewerber&amp;Studenten-5.R체ckfrageBewerbung">5.&nbsp;&nbsp;&nbsp;&nbsp; R&uuml;ckfrage Bewerbung</h1><p>Hallo Benjamin,</p><p>Wie geht es dir? Bist du nach wie vor auf Stellensuche?</p><p>An unserer Firmenf&uuml;hrung hast einen guten Eindruck bei uns hinterlassen. Falls du weiterhin an unserem Software Trainee-Programm interessiert bist, schick uns doch deine Bewerbung. Wir sind zurzeit wieder auf der Suche nach neuen Trainees.</p><p>Es w&uuml;rde mich sehr freuen, von dir zu h&ouml;ren.</p><p>Freundliche Gr&uuml;sse<br />Rachel</p><hr /><p>Hallo,</p><p>Magst du dich noch an unser Software Trainee-Programm erinnern? Du warst mal bei uns an einem Info-Anlass dazu. Unser Trainee-Programm ist inwzischen stark gewachsen, zurzeit besch&auml;ftigen wir 12 Trainees und es sind viele spannende Partnerfirmen dazu gekommen (siehe Flyer). Auch unser neues Video m&ouml;chte ich dir nicht vorenthalten:&nbsp;<a class="external-link" href="https://www.youtube.com/watch?v=pgH4HH1j4OE" rel="nofollow">https://www.youtube.com/watch?v=pgH4HH1j4OE</a></p><p>Nun hast du bereits einen Job gefunden oder bist du nach wie vor interessiert an unserem&nbsp;<a class="external-link" href="https://www.m-f.ch/images/Stelleninserat_Traineeprogramm_170315.pdf" rel="nofollow">Jobangebot</a>? Ich w&uuml;rde mich sehr &uuml;ber eine Bewerbung von dir freuen.&nbsp;</p><p>Wenn du Fragen hast, kannst du mich gerne kontaktieren.</p><p>Beste Gr&uuml;sse und sch&ouml;ner Tag,</p><p>Rachel</p><hr /><p>Hallo</p><p>Magst du dich noch an unser <a class="external-link" href="https://www.m-f.ch/software-trainee-programm" rel="nofollow">Software Trainee-Programm</a> erinnern? Du warst mal bei uns an einem Info-Anlass dazu.&nbsp;Wir haben dieses Jahr 5 neue Partnerfirmen dazugewonnen (Besi, Safran Vectronix, Geberit, finnova, Axetris). Eine aktuelle &Uuml;bersicht und mehr Details zu allen Partnerfirmen im Trainee-Programm findest du in unserer&nbsp;<a class="external-link" href="https://www.m-f.ch/images/MF-Trainee-Programm-Partnerfirmen.pdf" rel="nofollow">Brosch&uuml;re</a>.</p><p>Ich wollte dich informieren, dass wir ab Februar 2021 wieder Trainees rekrutieren. Wie sieht es bei dir aus? Hast du unterdessen einen Job gefunden oder bist du nach wie vor am Trainee-Programm interessiert?&nbsp;</p><p>Ich w&uuml;rde mich freuen, von dir zu h&ouml;ren.</p><p>Liebe Gr&uuml;sse<br />Anna Laura<br /></p><h1 id="KorrespondenzBewerber&amp;Studenten-6.Bewerbungsbest채tigung/EinladungCodility">6.&nbsp; &nbsp; Bewerbungsbest&auml;tigung / Einladung Codility</h1><p>Liebe/r&nbsp;XY,<br />Bei&nbsp;uns&nbsp;sind&nbsp;wir&nbsp;alle&nbsp;per&nbsp;Du, deshalb spreche ich dich gleich mit deinem Vornamen an. Ich hoffe, das ist in Ordnung f&uuml;r dich.&nbsp;<br /><span data-colorid="e5436t0t47">Zuerst mal vielen Dank f&uuml;r deine Bewerbung. Es freut mich, dass du dich f&uuml;r uns und unser Software Trainee-Programm interessierst. Deine Bewerbungsunterlagen sehen sehr interessant aus und k&ouml;nnten gut zum Trainee-Programm passen.</span><br /><span data-colorid="xlut6rbzj8">Gerne w&uuml;rde ich dir in einem ersten Schritt unseren Online-Programmiertest schicken, sodass wir schon mal sehen k&ouml;nnen, wie deine Programmierkenntnisse sind. Dies geh&ouml;rt zu unserem Standard-Bewerbungsprozess (</span><a class="external-link" href="https://www.m-f.ch/jobs" rel="nofollow">siehe Jobs-Page</a><span data-colorid="s7u5gztjm3">). Der Test dauert maximal 140 Minuten, besteht aus drei Aufgaben und ist in der Programmiersprache deiner Wahl l&ouml;sbar. Den Zeitpunkt, wann du den Test l&ouml;sen m&ouml;chtest, kannst du ebenfalls frei w&auml;hlen. Ich w&uuml;rde dir den Link in einer separaten Mail schicken. Ist das gut f&uuml;r dich?</span></p><p><span data-colorid="z5la6m5i2g">Besten Dank und einen sch&ouml;nen Tag!</span><br /><span data-colorid="m870o69eb7">Viele Gr&uuml;sse Anna Laura</span></p><p /><h1 id="KorrespondenzBewerber&amp;Studenten-7.Einladung1.Interview">7.&nbsp;&nbsp;&nbsp;&nbsp;Einladung 1. Interview</h1><p>Liebe/r XY<br />Vielen Dank f&uuml;r das rasche L&ouml;sen des&nbsp;Codility-Tests. Deine L&ouml;sungen sehen soweit gut aus (auch wenn du nicht die volle Punktzahl&nbsp;geholt hast).&nbsp;</p><p>Feedback&nbsp;von meinem Kollegen (Senior Ingenieur):</p><ul><li><p>Insgesamt sauberer Code</p></li><li><p>In der ersten Aufgabe hat sie die negative Zahlen vergessen</p></li><li><p>In der 4. Aufgabe ist sie &uuml;ber eine h&auml;ssliche Eigenheit von Java gestolpert. Ansonsten k&auml;me sie da locker auf &gt;60 %</p></li></ul><p><br />Wir w&uuml;rden dich deshalb sehr gerne&nbsp;zum&nbsp;ersten Interview einladen. Wann h&auml;ttest du Zeit? Kommende Woche w&uuml;rde beispielsweise der Mittwoch, Donnerstag oder Freitag gut passen. Das erste Interview dauert in der Regel etwa 1.5h und ist gemeinsam mit einem Senior Ingenieur und mir.&nbsp;</p><p>Beste Gr&uuml;sse und einen sch&ouml;nen Abend,<br />Rachel</p><hr /><p>Hallo XY<br />Vielen Dank f&uuml;r das L&ouml;sen des&nbsp;Codility-Tests. Du findest den Report anbei. Wir haben dein Ergebnis soeben intern besprochen und w&uuml;rden dich sehr gerne&nbsp;zum&nbsp;ersten Interview einladen. Zur Vorbereitung empfehle ich dir folgenden&nbsp;<a class="external-link" href="https://www.m-f.ch/blog/softwareentwicklung-fuer-elektroingenieure" rel="nofollow">Blog-Beitrag</a>, falls du diesen nicht schon kennst.&nbsp;</p><p>Wann h&auml;ttest du jeweils Zeit? Ich bin diese Woche nur noch bis am Donnerstag im B&uuml;ro und danach eine Woche in den Ferien. Das erste Interview dauert etwa 1.5h.&nbsp;</p><p>Ich freue mich, von dir zu h&ouml;ren.<br />Beste Gr&uuml;sse Rachel</p><p /><h1 id="KorrespondenzBewerber&amp;Studenten-8.Einladung2.Interview">8.&nbsp;  Einladung 2. Interview</h1><p>Hallo XY</p><p>Danke vielmals f&uuml;r deinen Besuch bei uns. Ich hoffe, es war auch f&uuml;r dich ein angenehmes Gespr&auml;ch.&nbsp;</p><p>Ich m&ouml;chte dich gar nicht l&auml;nger auf die Folter spannen und dir bereits mitteilen, dass wir dich gerne zum zweiten Interview einladen m&ouml;chten. Bitte schicke mir doch noch die Referenz, sobald du es abkl&auml;ren konntest.</p><p>Falls du &uuml;bern&auml;chste Woche bereits f&uuml;rs zweite Interview vorbei kommen m&ouml;chtest, zurzeit w&auml;re der Mittwoch, 16.10. Nachmittags und Freitag, 18.10. Nachmittags noch frei. Kl&auml;r doch mal ab, wann es dir passen w&uuml;rde.</p><p>Ich freue mich, wieder von dir zu h&ouml;ren und w&uuml;nsche dir einen sch&ouml;nen Abend.</p><p>Beste Gr&uuml;sse Rachel&nbsp;<br /></p><hr /><p>Hallo&nbsp;Florian,</p><p>Besten Dank f&uuml;r die weitere Referenz der SCS.</p><p>Die Referenzen konnten unseren positiven Eindruck von dir nur best&auml;tigen, deshalb w&uuml;rden wir dich sehr gerne zu einem 2. Interview einladen.&nbsp;</p><p>Wir h&auml;tten am 4., 11. oder 13. Januar 2017 Zeit, wie sieht es dann bei dir aus?</p><p>Voraussichtlich wird unser Gesch&auml;ftsf&uuml;hrer Reto B&auml;ttig sowie Christian Ewald (Software-Entwickler) am Gespr&auml;ch teilnehmen und das Assessment f&uuml;hren. Hast du einen eigenen Rechner, den du mitbringen m&ouml;chtest oder sollen wir einen zur Verf&uuml;gung stellen?</p><p>Anbei sende ich dir wie versprochen die Vorlage f&uuml;r den Arbeitsvertrag. Falls du Fragen dazu hast, kannst du mich gerne kontaktieren oder gleich am Interview Reto fragen.</p><p>Ich freue mich, von dir zu h&ouml;ren!</p><p>Bis bald &amp; freundliche Gr&uuml;sse, Rachel</p><p /><hr /><p>Liebe Alexandra,</p><p>Danke nochmals f&uuml;r das Gespr&auml;ch gestern. Nach R&uuml;cksprache mit Michael darf ich dir mitteilen, dass wir dich gerne&nbsp;zum&nbsp;zweiten&nbsp;Interview&nbsp;einladen. Bei der Sch&auml;tzaufgabe hast du zwar nicht brilliert, aber die technischen Fragen konntest du solide beantworten. Ausserdem wirkst du sehr motiviert und w&uuml;rdest gut ins Trainee-Programm passen. </p><p>Wie bereits erw&auml;hnt, w&uuml;rde ich vorab gerne noch 2-3 Referenzen telefonisch einholen. Kannst du mir entsprechende Kontaktpersonen (Vorgesetzte, Betreuer von Arbeiten etc.) angeben?&nbsp;</p><p>Das zweite Interview dauert in der Regel 3 Stunden und findet mit Reto zusammen mit einem Senior Engineer statt.&nbsp;Es besteht aus einer IT Infrastruktur-, Modellierungs- und einer Programmieraufgabe. Am besten w&auml;re es, wenn du einen eigenen Laptop mit einer Entwicklungsumgebung mitnehmen w&uuml;rdest, die du kennst. Du darfst bei der Programmieraufgabe die Sprache frei w&auml;hlen und das Internet verwenden.</p><p>Betreffend Termin f&uuml;rs 2.&nbsp;Interview&nbsp;w&auml;ren folgende Tage noch frei:</p><ul><li><p>Donnerstag Vormittag, 25.03.</p></li></ul><ul><li><p>Freitag Nachmittag, 26.03.&nbsp;</p></li></ul><ul><li><p>Dienstag Nachmittag, 30.03.</p></li></ul><ul><li><p>Mittwoch Nachmittag, 31.03.&nbsp;</p></li></ul><p>Passt dir einer dieser Tage? Und bringst du selbst einen Laptop mit oder sollen wir einen organisieren?</p><p>Bis bald &amp; freundliche Gr&uuml;sse, Rachel</p><p /><h1 id="KorrespondenzBewerber&amp;Studenten-9.Absage">9.&nbsp;&nbsp;&nbsp;&nbsp; Absage</h1><h2 id="KorrespondenzBewerber&amp;Studenten-9.1direkteAbsage">9.1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; direkte Absage</h2><p>Hallo XY,</p><p>Vielen Dank f&uuml;r deine Bewerbung. Wir haben deine Unterlagen soeben intern besprochen, sind jedoch zum Schluss gekommen, dass deine Vorkenntnisse sowie auch deine schulischen Leistungen leider nicht f&uuml;r unser Trainee-Programm reichen.&nbsp;</p><p>Ich w&uuml;nsche dir f&uuml;r die Stellensuche viel Erfolg und hoffe, dass du bald deine Traumstelle findest.&nbsp;</p><p>Alles Gute und beste Gr&uuml;sse Rachel</p><hr /><p>Guten Tag Herr XY</p><p>Vielen Dank f&uuml;r Ihre Bewerbung und Ihr Interesse an unserem Software Trainee-Programm. Wir haben die Unterlagen soeben intern besprochen, sind jedoch zum Schluss gekommen, dass Ihre Vorkenntnisse im Bereich Software-Engineering leider nicht f&uuml;r unser Trainee-Programm reichen.&nbsp;Wir w&uuml;nschen Ihnen viel Erfolg bei der Jobsuche und hoffen, dass Sie bald Ihre Traumstelle finden.&nbsp;</p><p>Alles Gute und beste Gr&uuml;sse Rachel Blaser</p><hr /><p>Sehr geehrte/r Herr/Frau XY,</p><p>Vielen Dank f&uuml;r Ihre Bewerbung und Ihr Interesse an unserem Software Trainee-Programm. F&uuml;r unser Trainee-Programm werden einen Bachelor- oder Masterabschluss sowie sehr gute Deutschkenntnisse (Niveau C1) vorausgesetzt. Gerne d&uuml;rfen Sie sich wieder bei uns melden, sobald Sie Ihr Studium abgeschlossen haben. Bis dahin w&uuml;nschen wir Ihnen viel Erfolg bei der Stellensuche.<br /><br />Alles Gute und beste Gr&uuml;sse Rachel Blaser</p><hr /><p>Dear XY</p><p><span data-colorid="b9mwk6de8p">Many thanks for your interest and your application. Unfortunately, fluent German speaking and writing (minimum C1) is a must for all our jobs. So as soon as you have improved your German to C1 you can write me an email again and we will consider your application. I hope that's fine for you.</span><br /><br /><span data-colorid="oe8odycwzw">Until then, I wish you all the best.</span></p><p>Best Regards,</p><p>Rachel</p><p><br /></p><h2 id="KorrespondenzBewerber&amp;Studenten-9.2AbsagenachCodility">9.2&nbsp; &nbsp; &nbsp; &nbsp; Absage nach Codility</h2><p>Lieber XY<br />Vielen Dank f&uuml;r das L&ouml;sen der Codility-Aufgaben. Wir haben deine L&ouml;sungsvorschl&auml;ge intern besprochen, sind jedoch zum Schluss gekommen, dass deine Vorkenntnisse leider nicht f&uuml;r unser Trainee-Programm reichen. Beispielsweise &uuml;bergibst du in der &quot;verbesserten&quot; Version der Aufgabe 1 den R&uuml;ckgabewert einer&nbsp;Funktion &uuml;ber eine globale Variable&nbsp;(ElementForArray) und dies ist gem&auml;ss Aussage unserer Seniors ein absolutes No-Go.&nbsp;Die Aufgabe 2 war aber gut gel&ouml;st. Verglichen zu den bestehenden Trainees und anderen Bewerbern m&uuml;sstest du vermutlich zu viel Grundlagen-Know-how aufholen. Ich hoffe, du verstehst unseren Entscheid.<br /><br />Ich w&uuml;nsche dir f&uuml;r die Stellensuche viel Erfolg und hoffe, dass du bald deine Traumstelle findest.<br />Alles Gute und beste Gr&uuml;sse Rachel</p><hr /><p>Lieber XY</p><p>Vielen Dank f&uuml;r das L&ouml;sen des Codility Tests, du findest deinen Report anbei. Ich konnte dein Ergebnis nun mit einem Senior Ingenieur besprechen. Leider sind wir zum Schluss gekommen, dass dieses Ergebnis nicht f&uuml;rs Trainee-Programm reicht. Deine Ans&auml;tze sind gut, aber unserer Meinung nach ist es zu laienhaft implementiert.&nbsp;</p><p>Feedback von meinem Kollegen:<br /><em>Er scheint noch nicht wirklich viel Python Erfahrung zu haben, da die 1. Aufgabe etwas umst&auml;ndlich gel&ouml;st wurde.</em><br /><em>Die 2. Aufgabe finde ich ok gel&ouml;st.</em><br /><em>Die Formel in der 3. Aufgabe funktioniert nur f&uuml;r Spezialf&auml;lle. Zuf&auml;lligerweise funktioniert es f&uuml;r die Beispiele (was ziemlich fies ist). Ich dachte erst, er h&auml;tte zu wenig Zeit gehabt, aber die Aussage, dass an der sqrt() Funktion etwas nicht stimmt, finde ich ein bisschen bedenklich.</em><br /></p><p>Ich wollte dir das Feedback eins-zu-eins weitergeben, sodass du unseren Entscheid nachvollziehen kannst. Falls du noch Fragen dazu hast, kannst du dich gerne bei mir melden.<br />Ich danke dir f&uuml;r dein Interesse und w&uuml;nsche dir viel Erfolg bei der Stellensuche und weiterhin alles Gute!</p><p>Beste Gr&uuml;sse Rachel&nbsp;&nbsp;</p><hr /><p>Hallo XY<br />Zuerst mal vielen Dank f&uuml;r das L&ouml;sen der&nbsp;Codility-Aufgaben, du findest deinen Report anbei. Wie du vielleicht auch selbst gemerkt hast, reicht dieses Ergebnis leider nicht f&uuml;rs Trainee-Programm. Deine Ans&auml;tze sind gut, aber unserer Meinung nach hast du zurzeit noch zu wenig Programmiererfahrung.&nbsp;</p><p>Mein Kollege (Senior Ingenieur) hat mir folgendes Feedback zu deinem Codility Report gegeben:</p><ul><li><p>Dieser Test ist so einfach, dass 51% doch arg wenig ist</p></li><li><p>Aufgabe 1 hat 100% Score, ist aber etwas sehr minimalistisch geschrieben</p></li><li><p>Aufgabe 2 ist zu minimalistisch und deshalb falsch</p></li><li><p>Bei Aufgabe 3 ist ihm die Zeit ausgegangen, hat auch fundamentale Fehler</p></li><li><p>Aufgabe 4 ist einigermassen sauber gel&ouml;st. Wieso er aufgeh&ouml;rt hat bevor er ganz fertig war, ist mir ein R&auml;tsel. Die letzte Zeile ist IMO einfach nur schlecht.</p></li></ul><p>Dieses Feedback wollte ich dir nicht vorenthalten, sodass du auch unseren Entscheid besser nachvollziehen und weisst, wo du dich noch verbessern kannst.&nbsp;</p><p>Du darfst dich gerne wieder bei uns melden, wenn du das Gef&uuml;hl hast, die n&ouml;tigen Vorkenntnisse f&uuml;rs Trainee-Programm erlangt zu haben. Bis dahin w&uuml;nsche ich dir viel Erfolg und alles Gute!</p><p>Beste Gr&uuml;sse Rachel</p><h2 id="KorrespondenzBewerber&amp;Studenten-9.3Absagenach1.Interview">9.3&nbsp; &nbsp; &nbsp; &nbsp; Absage nach 1. Interview</h2><p><strong>&rarr; wenn erreichbar, dann telefonisch!</strong></p><p>Guten Tag Herr XY,</p><p>Ich m&ouml;chte mich nochmals herzlich f&uuml;r das freundliche Bewerbungsgespr&auml;ch vom letzten Freitag bedanken. Nach R&uuml;cksprache mit XY muss ich Ihnen jedoch mitteilen, dass es vom <span class="legacy-color-text-blue1">technischen Niveau</span> nicht reicht, um am Trainee-Programm teilzunehmen.&nbsp;</p><p>Ich bedanke mich f&uuml;r Ihr Interesse und w&uuml;nsche Ihnen f&uuml;r die Zukunft alles Gute.</p><p>Freundliche Gr&uuml;sse</p><hr /><p>Hallo XY<br />Ich m&ouml;chte mich nochmals f&uuml;r das offene Gespr&auml;ch und deinen Besuch bei uns bedanken. Nach R&uuml;cksprache mit XY muss ich dir jedoch mitteilen, dass wir dich leider nicht&nbsp;zum&nbsp;zweiten&nbsp;Interview&nbsp;einladen. Der Hauptgrund daf&uuml;r sind die fehlenden OO-Kenntnisse.</p><p><em>Ausserdem haben wir das Gef&uuml;hl, dass du im Embedded-Umfeld besser aufgehoben bist. Als pers&ouml;nlicher Tipp f&uuml;r weitere Interviews: Versuche dich noch etwas klarer und bestimmter auszudr&uuml;cken, um dabei mehr Sicherheit und Klarheit auszustrahlen. Falls du nicht genau verstehst, was ich meine, kannst du mich auch gerne kurz anrufen.</em></p><p><em>oder&nbsp;</em></p><p><em><span data-colorid="mi9a7ovx98">Ausserdem sind wir nicht ganz sicher, ob es aufgrund deiner Interessen das Richtige f&uuml;r dich ist. Deine Motivation f&uuml;rs Trainee-Programm und die Begeisterung an Software Engineering haben wir etwas vermisst.</span></em></p><p>Ich hoffe, du verstehst unseren Entscheid. Ich bedanke mich f&uuml;r dein Interesse und w&uuml;nsche dir f&uuml;r die Zukunft alles Gute.</p><hr /><p>Lieber XY,</p><p>Ich m&ouml;chte mich nochmals f&uuml;r das offene Gespr&auml;ch und deinen Besuch bei uns bedanken. Nach R&uuml;cksprache mit Michael muss ich dir jedoch mitteilen, dass wir dich mit deinem&nbsp;aktuellen Wissensstand leider nicht zum zweiten Interview einladen. Der Hauptgrund daf&uuml;r sind die fehlenden OOP-Kenntnisse.&nbsp;</p><p>Wenn du in die Softwareentwicklung einsteigen m&ouml;chtest, empfehle ich dir einen OOP-Kurs zu besuchen, wie bspw.&nbsp;<a class="external-link" href="https://www.udemy.com/course/csharp-intermediate-classes-interfaces-and-oop/" rel="nofollow">https://www.udemy.com/course/csharp-intermediate-classes-interfaces-and-oop/</a> </p><p>Weitere Tipps und B&uuml;cherempfehlungen findest du hier:&nbsp;<a class="external-link" href="https://www.m-f.ch/blog/softwareentwicklung-fuer-quereinsteiger" rel="nofollow">https://www.m-f.ch/blog/softwareentwicklung-fuer-quereinsteiger</a> &nbsp;Insbesondere das&nbsp;<a class="external-link" href="https://www.amazon.de/-/en/Eric-Freeman-dp-149207800X/dp/149207800X/ref=dp_ob_title_bk" rel="nofollow">Buch &quot;Head First Design Patterns&quot;</a>&nbsp;hat eine gute Einf&uuml;hrung in OOP und UML.</p><p>Falls du etwas mehr Zeit investieren m&ouml;chtest, k&ouml;nnen wir dir auch folgendes Bootcamp empfehlen:&nbsp;<a class="external-link" href="https://learning.constructor.org/de/full-stack" rel="nofollow">https://learning.constructor.org/de/full-stack</a> Einige unserer &quot;Quereinsteiger&quot;-Trainees haben dies vorg&auml;ngig absolviert.</p><p>Ich hoffe, du verstehst unseren Entscheid. Gerne darfst du dich auch zu einem sp&auml;teren Zeitpunkt wieder bei uns melden. Ich bedanke mich f&uuml;r dein Interesse und w&uuml;nsche dir f&uuml;r die Zukunft alles Gute.</p><p>Beste Gr&uuml;sse Rachel</p><hr /><p>Lieber Julius,</p><p>Ich m&ouml;chte mich nochmals f&uuml;r das offene Gespr&auml;ch und deinen Besuch bei uns bedanken. Nach R&uuml;cksprache mit Linus muss ich dir jedoch mitteilen, dass wir dich mit deinem aktuellen Wissensstand leider nicht zum zweiten Interview einladen k&ouml;nnen. Der Hauptgrund daf&uuml;r sind die fehlenden OOP-Kenntnisse und Projekterfahrungen. </p><p>Wenn du in die Softwareentwicklung einsteigen m&ouml;chtest, empfehle ich dir einen OOP-Kurs zu besuchen, wie bspw. <a class="external-link" data-card-appearance="inline" href="https://www.udemy.com/course/csharp-intermediate-classes-interfaces-and-oop/" rel="nofollow">https://www.udemy.com/course/csharp-intermediate-classes-interfaces-and-oop/</a>  und anschliessend ein Fullstack-Projekt umzusetzen.</p><p>Weitere Tipps und B&uuml;cherempfehlungen findest du im erw&auml;hnten <a class="external-link" href="https://www.m-f.ch/blog/softwareentwicklung-fuer-quereinsteiger" rel="nofollow">Blogbeitrag</a>.&nbsp;Insbesondere das Buch &quot;Head First Design Patterns&quot; hat eine gute Einf&uuml;hrung in OOP und UML. Das von dir bestellte Buch &quot;Clean Code&quot; ist ebenfalls wichtig.</p><p>Falls du etwas mehr Zeit und Geld investieren kannst, empfehlen wir dir zudem folgendes Bootcamp: <a class="external-link" data-card-appearance="inline" href="https://learning.constructor.org/de/full-stack" rel="nofollow">https://learning.constructor.org/de/full-stack</a>  Einige unserer &quot;Quereinsteiger&quot;-Trainees haben dies vorg&auml;ngig absolviert.</p><p>Falls du dich mittels Selbststudium, Bootcamp oder Praktikum im Bereich OOP weitergebildet hast, darfst du dich gerne wieder bei uns melden und zum zweiten Interview kommen. Du hast bei uns einen sehr motivierten und positiven Eindruck hinterlassen.&nbsp;</p><p>Ich hoffe, du verstehst unseren Entscheid. Wenn du Fragen zu meinem Feedback hast, melde dich ungeniert bei mir.&nbsp;</p><p>Beste Gr&uuml;sse Rachel<br /></p><h2 id="KorrespondenzBewerber&amp;Studenten-9.4Absagenach2.Interview">9.4&nbsp; &nbsp; &nbsp; &nbsp; Absage nach 2. Interview</h2><p><strong>&rarr; wenn erreichbar, dann telefonisch!</strong></p><p>Lieber XY<br />Ich m&ouml;chte mich f&uuml;r deinen Besuch bei uns bedanken. Nach R&uuml;cksprache mit Reto und XY muss ich dir jedoch mitteilen, dass wir uns f&uuml;r einen anderen Bewerber entschieden haben. Du bringst zwar schon viele Kenntnisse mit und hast die Aufgaben im zweiten Interview gut gel&ouml;st, aber wir haben jemanden gefunden, der uns noch mehr &uuml;berzeugen konnte.&nbsp;</p><p>Ich pers&ouml;nlich kann dir als Feedback zum ersten Interview noch Folgendes auf den Weg geben: Du darfst ruhig mehr Begeisterung und Interesse zeigen, dies haben wir etwas zu wenig gesp&uuml;rt. Versuche ausserdem etwas klarer und &uuml;berzeugter zu kommunizieren. Als Bewerber darfst du auch gewisse Forderungen stellen und sagen, was du von einem Arbeitgeber erwartest und was dir wichtig ist.&nbsp;<br /><br />Ich hoffe, du verstehst unseren Entscheid. Ansonsten kannst du dich auch gerne telefonisch bei mir melden. Ich bedanke mich vielmals f&uuml;r dein Interesse und w&uuml;nsche dir f&uuml;r die Zukunft alles Gute und dass du bald deinen Traumjob findest.</p><p>Beste Gr&uuml;sse Rachel</p><p><br /></p><p><br /></p>
                    </div>

                    
                                                      
                </div>             </div> 
            <div id="footer" role="contentinfo">
                <section class="footer-body">
                    <p>Document generated by Confluence on Okt. 15, 2024 12:04</p>
                    <div id="footer-logo"><a href="http://www.atlassian.com/">Atlassian</a></div>
                </section>
            </div>
        </div>     </body>
</html>
