<!DOCTYPE html>
<html>
    <head>
        <title>Cudos Trail : FAQ Interessenten / Bewerber / Juniors</title>
        <link rel="stylesheet" href="styles/site.css" type="text/css" />
        <META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    </head>

    <body class="theme-default aui-theme-default">
        <div id="page">
            <div id="main" class="aui-page-panel">
                <div id="main-header">
                    <div id="breadcrumb-section">
                        <ol id="breadcrumbs">
                            <li class="first">
                                <span><a href="index.html">Cudos Trail</a></span>
                            </li>
                                                    <li>
                                <span><a href="Cudos-Trail-Startseite_5639668934.html">Cudos Trail Startseite</a></span>
                            </li>
                                                </ol>
                    </div>
                    <h1 id="title-heading" class="pagetitle">
                                                <span id="title-text">
                            Cudos Trail : FAQ Interessenten / Bewerber / Juniors
                        </span>
                    </h1>
                </div>

                <div id="content" class="view">
                    <div class="page-metadata">
                        
        
    
        
    
        
        
            Created by <span class='author'> Rachel Blaser</span>, last modified by <span class='editor'> marianne.petitpierre</span> on Juli 31, 2024
                        </div>
                    <div id="main-content" class="wiki-content group">
                    <p><style>[data-colorid=w1p4q8mc7u]{color:#222222} html[data-color-mode=dark] [data-colorid=w1p4q8mc7u]{color:#dddddd}[data-colorid=r3yigeqtew]{color:#222222} html[data-color-mode=dark] [data-colorid=r3yigeqtew]{color:#dddddd}[data-colorid=eb7yqelhy1]{color:#222222} html[data-color-mode=dark] [data-colorid=eb7yqelhy1]{color:#dddddd}[data-colorid=u8xv78f8ec]{color:#222222} html[data-color-mode=dark] [data-colorid=u8xv78f8ec]{color:#dddddd}[data-colorid=dbe3fdlfbv]{color:#222222} html[data-color-mode=dark] [data-colorid=dbe3fdlfbv]{color:#dddddd}[data-colorid=tp98gww9zw]{color:#222222} html[data-color-mode=dark] [data-colorid=tp98gww9zw]{color:#dddddd}[data-colorid=xyust8y6sm]{color:#222222} html[data-color-mode=dark] [data-colorid=xyust8y6sm]{color:#dddddd}[data-colorid=s7qh7wkexs]{color:#222222} html[data-color-mode=dark] [data-colorid=s7qh7wkexs]{color:#dddddd}[data-colorid=dhwfm7ujw3]{color:#222222} html[data-color-mode=dark] [data-colorid=dhwfm7ujw3]{color:#dddddd}[data-colorid=d66a8xtbva]{color:#222222} html[data-color-mode=dark] [data-colorid=d66a8xtbva]{color:#dddddd}[data-colorid=hqgakqnrko]{color:#222222} html[data-color-mode=dark] [data-colorid=hqgakqnrko]{color:#dddddd}[data-colorid=zg1ug97gcr]{color:#222222} html[data-color-mode=dark] [data-colorid=zg1ug97gcr]{color:#dddddd}[data-colorid=wsfh5573on]{color:#222222} html[data-color-mode=dark] [data-colorid=wsfh5573on]{color:#dddddd}[data-colorid=i3wulcvyv1]{color:#222222} html[data-color-mode=dark] [data-colorid=i3wulcvyv1]{color:#dddddd}</style><style type="text/css">/*<![CDATA[*/
div.rbtoc1728986670741 {padding: 0px;}
div.rbtoc1728986670741 ul {list-style: square;margin-left: 0px;}
div.rbtoc1728986670741 li {margin-left: 0px;padding-left: 0px;}

/*]]>*/</style></p><div class="toc-macro rbtoc1728986670741">
<ul class="toc-indentation">
<li><a href="#FAQInteressenten/Bewerber/Juniors-BEWERBUNG">BEWERBUNG</a>
<ul class="toc-indentation">
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:GibtesfixeStartdatenoderBewerbungsfristen?">Q: Gibt es fixe Startdaten oder Bewerbungsfristen?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:Ichbinmomentanimletzten(6.)SemestermeinesBachelorStudiums.KannichmichjetztbereitsfürdasCudosTrailbewerbenundnachdemSemesteranfangenoderbrauchtmanzuerstdenAbschluss?">Q: Ich bin momentan im letzten (6.) Semester meines Bachelor Studiums. Kann ich mich jetzt bereits f&uuml;r das Cudos Trail bewerben und nach dem Semester anfangen oder braucht man zuerst den Abschluss?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:DaichmeinenBachelornichtineinemtechnischenFachabgeschlossenhabe,wollteichSiefragen,obeineBewerbungbeiIhnenüberhauptAussichtaufErfolghätte?">Q: Da ich meinen Bachelor nicht in einem technischen Fach abgeschlossen habe, wollte ich Sie fragen, ob eine Bewerbung bei Ihnen &uuml;berhaupt Aussicht auf Erfolg h&auml;tte?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:WelcheUnterlagenmüssenbeiderBewerbungeingereichtwerden?">Q: Welche Unterlagen m&uuml;ssen bei der Bewerbung eingereicht werden?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:WiesiehtderBewerbungsprozessaus?">Q: Wie sieht der Bewerbungsprozess aus?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:Daichbeabsichtige,imBereichEmbeddedSystems/C++ProgrammierungFusszufassen,wollteichSiefragen,obSieIhrCudosTrailauchinmeinemFallempfehlenwürden?">Q: Da ich beabsichtige, im Bereich Embedded Systems / C++ Programmierung Fuss zu fassen, wollte ich Sie fragen, ob Sie Ihr Cudos Trail auch in meinem Fall empfehlen w&uuml;rden?</a></li>
</ul>
</li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-CODILITY">CODILITY</a>
<ul class="toc-indentation">
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:KannichdenLinkmehralseinmalöffnen?">Q: Kann ich den Link mehr als einmal &ouml;ffnen?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:GibteseineDeadlinebiswannichdenTestmachenmuss?">Q: Gibt es eine Deadline bis wann ich den Test machen muss?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-GibtesinnerhalbdiesesOnline-ProgrammiertestsauchdieMöglichkeiteineDemoaufgabezulösen,umsichmitdemToolvertrautzumachen?">Gibt es innerhalb dieses Online-Programmiertests auch die M&ouml;glichkeit eine Demoaufgabe zu l&ouml;sen, um sich mit dem Tool vertraut zu machen?</a></li>
</ul>
</li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-CROSS-COMPANY-PROGRAMMKONZEPT">CROSS-COMPANY-PROGRAMM KONZEPT</a>
<ul class="toc-indentation">
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:WieerfolgtbeiCudosdieZuteilungderTraineesaufdieFirmen?">Q: Wie erfolgt bei Cudos die Zuteilung der Trainees auf die Firmen?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:ImStudiumhabenwirganzvieleverschiedeneThemenangeschaut,aberichfühlemichinkeinemBereichsattelfest.WirddiesnachdemCudosTrailnichtauchsosein?">Q: Im Studium haben wir ganz viele verschiedene Themen angeschaut, aber ich f&uuml;hle mich in keinem Bereich sattelfest. Wird dies nach dem Cudos Trail nicht auch so sein?</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:KannmansichfüreineTechnologieentscheidenaufdiemansichfokussierenmöchte?ZumBeispielwürdeichmichgerneimBereichWebentwicklungspezialisierenundmeingrösstesInteresseliegtdabeiinJavaScriptTechnologien(node,react,usw.).">Q: Kann man sich f&uuml;r eine Technologie entscheiden auf die man sich fokussieren m&ouml;chte? Zum Beispiel w&uuml;rde ich mich gerne im Bereich Webentwicklung spezialisieren und mein gr&ouml;sstes Interesse liegt dabei in JavaScript Technologien (node, react, usw.).</a></li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:WiehochistdieWahrscheinlichkeit,dassmannachdemTrainee-ProgrammsichfüreineFirmaentscheidenkannunddannauchvonderFirmaaufgenommenwird?">Q: Wie hoch ist die Wahrscheinlichkeit, dass man nach dem Trainee-Programm sich f&uuml;r eine Firma entscheiden kann und dann auch von der Firma aufgenommen wird?</a></li>
</ul>
</li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-ANSTELLUNG">ANSTELLUNG</a>
<ul class="toc-indentation">
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:Teilzeitpensummöglich?">Q: Teilzeitpensum m&ouml;glich?</a></li>
</ul>
</li>
<li><a href="#FAQInteressenten/Bewerber/Juniors-CORONA-SITUATION">CORONA-SITUATION</a>
<ul class="toc-indentation">
<li><a href="#FAQInteressenten/Bewerber/Juniors-Q:WiewirddasProgrammwährendderjetzigenCoronaSituationorganisiertunddurchgeführt?ZumBeispielbeimPair-programmingmiteinemExperten.WirddiesallesperHome-OfficegeregeltoderwerdenauchVeranstaltungenvorOrtnochzurVerfügunggestell">Q: Wie wird das Programm w&auml;hrend der jetzigen Corona Situation organisiert und durchgef&uuml;hrt? Zum Beispiel beim Pair-programming mit einem Experten. Wird dies alles per Home-Office geregelt oder werden auch Veranstaltungen vor Ort noch zur Verf&uuml;gung gestellt?</a></li>
</ul>
</li>
</ul>
</div><p /><h2 id="FAQInteressenten/Bewerber/Juniors-BEWERBUNG">BEWERBUNG</h2><h4 id="FAQInteressenten/Bewerber/Juniors-Q:GibtesfixeStartdatenoderBewerbungsfristen?">Q: Gibt es&nbsp;<span>fixe Startdaten oder Bewerbungsfristen?</span></h4><p><span>A: Bewerbungsfristen oder fixe Startdaten gibt es in dem Sinne nicht. W</span>ir sind froh, wenn du uns bereits 2-3 Monate vor dem gew&uuml;nschten Startdatum deine Bewerbung schickst, aber auch dies ist nicht zwingend notwendig. Wir sind ziemlich flexibel und k&ouml;nnen den Bewerbungsprozess auch in 2-3 Wochen abwickeln.</p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:Ichbinmomentanimletzten(6.)SemestermeinesBachelorStudiums.KannichmichjetztbereitsfürdasCudosTrailbewerbenundnachdemSemesteranfangenoderbrauchtmanzuerstdenAbschluss?"><span>Q:&nbsp;</span>Ich bin momentan im letzten (6.) Semester meines Bachelor Studiums. Kann ich mich jetzt bereits f&uuml;r das Cudos Trail bewerben und nach dem Semester anfangen oder braucht man zuerst den Abschluss?</h4><p>A: Du kannst dich jetzt schon bewerben. Das Bachelordiplom kannst Du dann nachreichen, sobald du es erhalten hast. Und nat&uuml;rlich wird dann das Datum des Stellenantritts mit Dir abgesprochen, damit es f&uuml;r Dich stimmt.&nbsp;&nbsp;</p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:DaichmeinenBachelornichtineinemtechnischenFachabgeschlossenhabe,wollteichSiefragen,obeineBewerbungbeiIhnenüberhauptAussichtaufErfolghätte?">Q:&nbsp;<span data-colorid="zg1ug97gcr">Da ich meinen Bachelor nicht in einem technischen Fach abgeschlossen habe, wollte ich Sie fragen, ob eine Bewerbung bei Ihnen &uuml;berhaupt Aussicht auf Erfolg h&auml;tte?</span></h4><p><span data-colorid="wsfh5573on">A:&nbsp;Es ist grunds&auml;tzlich m&ouml;glich, auch ohne technischen Bachelor ins Trainee-Programm zu kommen. Du solltest aber schon Programmiererfahrung haben und dich mit objekt-orientierter Programmierung auskennen. Da du als Junior Software Engineer bei uns anfangen w&uuml;rdest und gleich in richtigen Projekten eingesetzt w&auml;rst, ist das Cudos Trail nicht darauf ausgelegt, dir Informatik, bzw. Grundlagen des Software Engineering beizubringen. Wenn du dich aber mit diesen Themen schon auseinandergesetzt und vielleicht auch schon ein Projekt in diesem Bereich gemacht hast, kannst du mir gerne mal deine Bewerbungsunterlagen schicken und wir schauen sie uns an.&nbsp;</span></p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:WelcheUnterlagenmüssenbeiderBewerbungeingereichtwerden?">Q: Welche Unterlagen m&uuml;ssen bei der Bewerbung eingereicht werden?</h4><p>A: CV, Motivationsschreiben, Diplome aus dem Studium sowie Abschlusszeugnisse. Falls das Studium noch nicht abgeschlossen ist, kann man das Diplom noch nachreichen. In diesem Falle reicht ein aktueller Leistungs&uuml;berblick mit den besuchten F&auml;chern und Noten.</p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:WiesiehtderBewerbungsprozessaus?">Q: Wie sieht der Bewerbungsprozess aus?&nbsp;</h4><p>A: Der Bewerbungsprozess ist der folgende:<br />1. Zuerst machst du einen Online-Programmiertest. Der wird bei danach von uns intern angeschaut, diskutiert und du bekommst auch Feedback.<br />2. Sollte der Online-Programmiertest gut sein, werden wir dich zu einem 1. Interview einladen. Das wird von Rachel Blaser, der Leiterin unseres Trainee-Programms und einem Senior Engineer gef&uuml;hrt.&nbsp;<br />3. Solltest das 1. Interview gut gehen, w&uuml;rden wir dich um Referenzen bitten und dich zu einem 2. Interview einladen. Das zweite Interview ist ein technisches, wo wir schauen, wie du eine konkrete Aufgabe l&ouml;sen w&uuml;rdest.&nbsp;<br />4. Wenn das zweite Interview gut geht, und beide Seiten - du und wir - einverstanden sind, w&uuml;rden wir ein Eintrittsdatum abmachen und dir einen Vertrag zukommen lassen.&nbsp;</p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:Daichbeabsichtige,imBereichEmbeddedSystems/C++ProgrammierungFusszufassen,wollteichSiefragen,obSieIhrCudosTrailauchinmeinemFallempfehlenwürden?">Q:&nbsp;<span data-colorid="d66a8xtbva">Da ich beabsichtige, im Bereich Embedded Systems / C++ Programmierung Fuss zu fassen, wollte ich Sie fragen, ob Sie Ihr Cudos Trail auch in meinem Fall empfehlen w&uuml;rden?</span>&nbsp;</h4><p>A:&nbsp;<span data-colorid="dhwfm7ujw3">Der Cudos Trail ist in erster Linie nicht auf die Embedded-Entwicklung&nbsp;</span><span data-colorid="w1p4q8mc7u">ausgerichtet. Aktuell sind ca. 30% aller Eins&auml;tze im Embedded / C++ Umfeld (Safran Vectronics, Thermoplan, Securosys, Rheinmetall, Franke). Einige Partnerfirmen haben sowohl Projekte im Embedded- sowie auch im Highlevel-Umfeld. Reine Web- / Frontendentwicklungs-Projekte sind es aber eher selten bis nie - meistens sind die Projekte Fullstack. Das heisst f&uuml;r dich, wir k&ouml;nnten dir nicht garantieren, dass all deine Junior-Eins&auml;tze im Embedded / C++ Umfeld sind, wir k&ouml;nnten aber sicherlich darauf R&uuml;cksicht nehmen und bei den entsprechenden Partnerfirmen nachfragen. Grunds&auml;tzlich suchen wir aber Juniors, die an ganz unterschiedlichen TechStacks interessiert sind. Also wenn du schon genau weisst, in welchem Bereich du arbeiten m&ouml;chtest, ist das Cross-Company-Programm vielleicht nicht das Richtige f&uuml;r dich. Wenn du aber offen bist, unterschiedliche Firmen, Branchen und Technologien kennenzulernen, dann freuen wir uns auf deine Bewerbung.</span></p><h2 id="FAQInteressenten/Bewerber/Juniors-CODILITY">CODILITY</h2><h4 id="FAQInteressenten/Bewerber/Juniors-Q:KannichdenLinkmehralseinmalöffnen?">Q: Kann ich den Link mehr als einmal &ouml;ffnen?</h4><p>A: Ja, du kannst ihn mehrmals brauchen. Der Link f&uuml;hrt dich zur Testumgebung. Dort&nbsp;<span data-colorid="dbe3fdlfbv">du kannst dann entweder Demo-Aufgaben l&ouml;sen machen oder den richtigen Test starten.</span></p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:GibteseineDeadlinebiswannichdenTestmachenmuss?"><span data-colorid="tp98gww9zw">Q: Gibt es eine Deadline bis wann ich den Test machen muss?&nbsp;</span></h4><p><span data-colorid="r3yigeqtew">A:&nbsp;Es gibt keine Deadline f&uuml;r die Absolvierung des Tests, aber solange du ihn nicht ausgef&uuml;llt hast, k&ouml;nnen wir mit deiner Bewerbung nicht weitermachen. Daher w&uuml;rde ich dir empfehlen, nicht allzu lange zu warten. Du kannst dir aber gerne eine Woche Zeit nehmen, damit du auch einen ruhigen Tag daf&uuml;r hast. Falls du etwas l&auml;nger brauchen m&ouml;chtest, kannst du mir auch gerne Bescheid geben. Dann wissen wir, wann wir mit dem Resultat rechnen k&ouml;nnen.&nbsp;</span></p><h4 id="FAQInteressenten/Bewerber/Juniors-GibtesinnerhalbdiesesOnline-ProgrammiertestsauchdieMöglichkeiteineDemoaufgabezulösen,umsichmitdemToolvertrautzumachen?"><span data-colorid="eb7yqelhy1">Gibt es innerhalb dieses Online-Programmiertests auch die M&ouml;glichkeit eine Demoaufgabe zu l&ouml;sen, um sich mit dem Tool vertraut zu machen?</span></h4><p>A:&nbsp;<span data-colorid="hqgakqnrko">Es stehen dir innerhalb des Systems Demo-Aufgaben zur Verf&uuml;gung und du kannst dich zuerst mit dem Codility-System auseinandersetzten bevor du den richtigen Test beginnst.<span>&nbsp;</span></span></p><h2 id="FAQInteressenten/Bewerber/Juniors-CROSS-COMPANY-PROGRAMMKONZEPT"><span>CROSS-COMPANY-PROGRAMM KONZEPT</span></h2><h4 id="FAQInteressenten/Bewerber/Juniors-Q:WieerfolgtbeiCudosdieZuteilungderTraineesaufdieFirmen?">Q: W<span>ie erfolgt bei Cudos die Zuteilung der Trainees auf die Firmen?</span></h4><p><span>A: Die Planung der einzelnen Eins&auml;tze erfolgt immer in Absprache mit den Juniors. Entweder schlagen mir die Juniors Firmen vor oder ich frage die Juniors, ob sie folgende Firmen interessieren w&uuml;rde. Entsprechend ist es einen gemeinsamen Entscheid und wenn immer m&ouml;glich wird R&uuml;cksicht auf die Interessen des Juniors genommen. Wir suchen aber grunds&auml;tzlich Juniors, die offen sind, ganz unterschiedliche Firmen kennen zu lernen.&nbsp;&rarr; Verweis auf Partnerfirmenbrosch&uuml;re</span></p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:ImStudiumhabenwirganzvieleverschiedeneThemenangeschaut,aberichfühlemichinkeinemBereichsattelfest.WirddiesnachdemCudosTrailnichtauchsosein?"><span>Q: Im Studium haben wir ganz viele verschiedene Themen angeschaut, aber ich f&uuml;hle mich in keinem Bereich sattelfest. Wird dies nach dem Cudos Trail nicht auch so sein? </span></h4><p><span>A: Klar, du wirst vielleicht nicht so tiefe Kenntnisse haben als die, die drei Jahre lang an der selben Technologie gearbeitet haben. Aber es ist sicher mehr als w&auml;hrend dem Studium. Im Studium hast du oft mehrere Themen auf einmal, und so viel zu tun, dass du evtl. gar nicht Zeit hast, dich mit jeder einzelnen Technologie oder Programmiersprache auseinanderzusetzten. W&auml;hrend dem Cudos Trail arbeitest du als Junior Software Engineer an einem richtigen Projekt f&uuml;r 6-12 Monate und befasst dich 100% mit diesem. Du &uuml;bernimmst teilweise Verantwortung und musst f&uuml;r dich auch im Projektteam durchsetzen. So bekommst du einen sehr guten Einblick. Der grosse Vorteil ist, dass du innerhalb der 3 Jahre mehrere Technologien und Programmiersprachen in Detail kennenlernst und so besser herausfinden kannst, in welche Richtung du in Zukunft gehen m&ouml;chtest.&nbsp;</span></p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:KannmansichfüreineTechnologieentscheidenaufdiemansichfokussierenmöchte?ZumBeispielwürdeichmichgerneimBereichWebentwicklungspezialisierenundmeingrösstesInteresseliegtdabeiinJavaScriptTechnologien(node,react,usw.)."><span>Q:&nbsp;</span>Kann man sich f&uuml;r eine Technologie entscheiden auf die man sich fokussieren m&ouml;chte? Zum Beispiel w&uuml;rde ich mich gerne im Bereich Webentwicklung spezialisieren und mein gr&ouml;sstes Interesse liegt dabei in JavaScript Technologien (node, react, usw.).</h4><p>Als Junior kann man grunds&auml;tzlich seine Interessen angeben, und ist auch in der Entscheidung eingebunden, bei welchen Firmen man einen Junior-Einsatz macht. Aber man sollte f&uuml;r verschiedene Bereiche offen sein, damit man auch so fest wie m&ouml;glich von den verschiedenen Eins&auml;tzen profitieren und sich ein guten Bild von den verschiedenen M&ouml;glichkeiten als Software-Engineer machen kann.&nbsp;</p><h4 id="FAQInteressenten/Bewerber/Juniors-Q:WiehochistdieWahrscheinlichkeit,dassmannachdemTrainee-ProgrammsichfüreineFirmaentscheidenkannunddannauchvonderFirmaaufgenommenwird?">Q: Wie hoch ist die Wahrscheinlichkeit, dass man nach dem Trainee-Programm sich f&uuml;r eine Firma entscheiden kann und dann auch von der Firma aufgenommen wird?</h4><p>A: Das Cross-Company-Programm ist so aufgebaut, dass alle Firmen, bei welchen Du einen Einsatz gemacht hast, die Gelegenheit erhalten, Dir ein Job-Angebot zu machen. Du kannst dich dann selbst entscheiden, ob Du eines dieser Angebote annimmst oder ob Du dich f&uuml;r eine andere Stelle entscheidest. Bis jetzt hat die grosse Mehrheit unserer Juniors, die abgeschlossen haben, eine Stelle in unserem Partnerfirmennetzwerk angenommen.&nbsp;</p><p><strong>Q:&nbsp;<span data-colorid="i3wulcvyv1">Der Fokus im Studium liegt jedoch bei Data Science und deshalb m&ouml;chte ich Sie fragen ob man bei bestimmten Partnerfirmen auch in diesem Bereich arbeiten kann?&nbsp;</span></strong></p><p><span data-colorid="xyust8y6sm"><span>A:&nbsp;<span data-colorid="u8xv78f8ec">Der Hauptfokus im Cudos Trail Software Engineering. Es gibt aber immer mehr Projekte auch im Data Science und ML Umfeld. Insbesondere im IoT Bereich machen unsere Engineers viel Datenverarbeitung und -visualisierung, bis hin zu Predictive Maintenance. H&auml;ufig k&uuml;mmern sich unsere Juniors mehr um den Software-Teil und arbeiten gezielt mit Data Scientists zusammen, so bspw. bei unserer Partnerfirma MSCI (siehe<span>&nbsp;</span></span><a class="external-link" href="https://www.m-f.ch/images/trainee-programm/TP-Partnerfirmen-Broschuere_2022-09.pdf" rel="nofollow">Partnerfirmen-Brosch&uuml;re</a><span data-colorid="s7qh7wkexs">). Wenn aber Interesse und Kenntnisse vorhanden sind, k&ouml;nnen wir bestimmt auch Data Science Projekte f&uuml;r Juniors &quot;organisieren&quot;. Ausserdem kommen jedes Jahr neue Partnerfirmen hinzu, welche teilweise auch von unseren Juniors vorgeschlagen werden. Nichtsdestotrotz sollte man im Cudos Trail Freude&nbsp;am Software-Entwickeln haben.</span></span></span></p><p><br /></p><h2 id="FAQInteressenten/Bewerber/Juniors-ANSTELLUNG"><span>ANSTELLUNG</span></h2><h4 id="FAQInteressenten/Bewerber/Juniors-Q:Teilzeitpensummöglich?"><span>Q: Teilzeitpensum m&ouml;glich?</span></h4><p><span>A:&nbsp;Grunds&auml;tzlich ist das Cross-Company-Programm auf ein 100%-Pensum ausgelegt, da die Partnerfirmen an einem m&ouml;glichst hohen Pensum interessiert sind und die verf&uuml;gbare Arbeitszeit bei der Partnerfirma selbst durch die ganzen Weiterbildungen, Mentorings und sonstigen Abwesenheiten bereits etwas reduziert ist. Nicht, dass du aufgrund des Pensums einen Nachteil gegen&uuml;ber den anderen Juniors hast. Bei Cudos selbst haben wir jedoch sehr viele Teilzeit-Mitarbeitende. Also wenn es nach dem zweiten Interview nur noch an diesem Punkt &quot;hapert&quot;, finden wir bestimmt eine L&ouml;sung. :) Ausserdem haben wir bei Cudos flexible Jahresarbeitszeiten, dadurch k&ouml;nnen sich die Mitarbeitenden ziemlich flexibel die Arbeitszeit selbst einteilen.</span></p><p><br /></p><h2 id="FAQInteressenten/Bewerber/Juniors-CORONA-SITUATION"><span>CORONA-SITUATION</span></h2><h4 id="FAQInteressenten/Bewerber/Juniors-Q:WiewirddasProgrammwährendderjetzigenCoronaSituationorganisiertunddurchgeführt?ZumBeispielbeimPair-programmingmiteinemExperten.WirddiesallesperHome-OfficegeregeltoderwerdenauchVeranstaltungenvorOrtnochzurVerfügunggestell">Q: Wie wird das Programm w&auml;hrend der jetzigen Corona Situation organisiert und durchgef&uuml;hrt? Zum Beispiel beim Pair-programming mit einem Experten. Wird dies alles per Home-Office geregelt oder werden auch Veranstaltungen vor Ort noch zur Verf&uuml;gung gestellt?</h4><p>A: Jede Partnerfirma ist ein bisschen anders organisiert, daher kann ich Dir keine allgemeine Auskunft geben. Es gibt Trainees welche teilweise immer noch im B&uuml;ro arbeiten, oder zumindest f&uuml;r Tests an Maschinen in die Firma gehen. Andere sind 100% im Homeoffice. Der Kontakt zum Team ist aber immer vorhanden. Wie Code Reviews oder Pair Programming aufgesetzt sind, ist auch wieder abh&auml;ngig von der Partnerfirma. Wie ich von unseren Trainees erfahre, werden diese Mechanismen nun virtuell durchgef&uuml;hrt, wie auch die t&auml;glichen/w&ouml;chentlichen Projektmeetings. Dies ist sicher auch aufgrund der aktuellen Regelung des Bundesrats. Sobald sich die Pandemie-Situation wieder &auml;ndert, kann sich auch die Zusammenarbeit innerhalb der Teams und Firmen wieder &auml;ndern.&nbsp;</p><p><br /></p>
                    </div>

                    
                                                      
                </div>             </div> 
            <div id="footer" role="contentinfo">
                <section class="footer-body">
                    <p>Document generated by Confluence on Okt. 15, 2024 12:04</p>
                    <div id="footer-logo"><a href="http://www.atlassian.com/">Atlassian</a></div>
                </section>
            </div>
        </div>     </body>
</html>
