<!DOCTYPE html>
<html>
    <head>
        <title>Cudos Trail : Akquise Partnerfirmen</title>
        <link rel="stylesheet" href="styles/site.css" type="text/css" />
        <META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    </head>

    <body class="theme-default aui-theme-default">
        <div id="page">
            <div id="main" class="aui-page-panel">
                <div id="main-header">
                    <div id="breadcrumb-section">
                        <ol id="breadcrumbs">
                            <li class="first">
                                <span><a href="index.html">Cudos Trail</a></span>
                            </li>
                                                    <li>
                                <span><a href="Cudos-Trail-Startseite_5639668934.html">Cudos Trail Startseite</a></span>
                            </li>
                                                </ol>
                    </div>
                    <h1 id="title-heading" class="pagetitle">
                                                <span id="title-text">
                            Cudos Trail : Akquise Partnerfirmen
                        </span>
                    </h1>
                </div>

                <div id="content" class="view">
                    <div class="page-metadata">
                        
        
    
        
    
        
        
            Created by <span class='author'> Rachel Blaser</span>, last modified by <span class='editor'> marianne.petitpierre</span> on Juli 05, 2024
                        </div>
                    <div id="main-content" class="wiki-content group">
                    <style type="text/css">/*<![CDATA[*/
div.rbtoc1728986661625 {padding: 0px;}
div.rbtoc1728986661625 ul {list-style: disc;margin-left: 0px;}
div.rbtoc1728986661625 li {margin-left: 0px;padding-left: 0px;}

/*]]>*/</style><div class="toc-macro rbtoc1728986661625"><style>[data-colorid=y6erjgb6ak]{color:#6888c9} html[data-color-mode=dark] [data-colorid=y6erjgb6ak]{color:#365697}[data-colorid=r3ag1194ay]{color:#6888c9} html[data-color-mode=dark] [data-colorid=r3ag1194ay]{color:#365697}</style>
<ul class="toc-indentation">
<li><a href="#AkquisePartnerfirmen-VorgehenfürdieKaltakquise">Vorgehen f&uuml;r die Kaltakquise</a>
<ul class="toc-indentation">
<li><a href="#AkquisePartnerfirmen-QuellenfürpotentiellePartnerfirmen">Quellen f&uuml;r potentielle Partnerfirmen</a></li>
<li><a href="#AkquisePartnerfirmen-Vorbereitung">Vorbereitung</a></li>
</ul>
</li>
<li><a href="#AkquisePartnerfirmen-Textvorlagen">Textvorlagen</a>
<ul class="toc-indentation">
<li><a href="#AkquisePartnerfirmen-Mailtext(JuniorschlägtPartnerfirmavor)">Mailtext (Junior schl&auml;gt Partnerfirma vor)</a></li>
<li><a href="#AkquisePartnerfirmen-Mailtext(JuniorwirbtdirektbeiFirma)">Mailtext (Junior wirbt direkt bei Firma)</a></li>
<li><a href="#AkquisePartnerfirmen-Mailtext-ErstkontaktV1(mitCalendly)">Mailtext - Erstkontakt V1 (mit Calendly)</a></li>
<li><a href="#AkquisePartnerfirmen-Mailtext-ErstkontaktV2(mitNutzenalsBulletpoints)">Mailtext - Erstkontakt V2 (mit Nutzen als Bulletpoints)</a></li>
<li><a href="#AkquisePartnerfirmen-Mailtext-ErstkontaktV3(ProblemFachkräftemangel)">Mailtext - Erstkontakt V3 (Problem Fachkr&auml;ftemangel)</a></li>
<li><a href="#AkquisePartnerfirmen-Mailtext-ErstkontaktV4(Englisch)">Mailtext - Erstkontakt V4 (Englisch)</a></li>
<li><a href="#AkquisePartnerfirmen-Mailtext-ErstkontaktV4(nachEmpfehlungundAnruf-nichterreicht)">Mailtext - Erstkontakt V4 (nach Empfehlung und Anruf - nicht erreicht)</a></li>
<li><a href="#AkquisePartnerfirmen-Mailtext–ZweitkontaktV1(nachJobmesse)">Mailtext &ndash; Zweitkontakt V1 (nach Jobmesse)</a></li>
<li><a href="#AkquisePartnerfirmen-Mailtext–ZweitkontaktV2(nachvielenJahren)">Mailtext &ndash; Zweitkontakt V2 (nach vielen Jahren)</a></li>
</ul>
</li>
<li><a href="#AkquisePartnerfirmen-FragenfürsersteTelefongespräch">Fragen f&uuml;rs erste Telefongespr&auml;ch</a>
<ul class="toc-indentation">
<li><a href="#AkquisePartnerfirmen-MailnachVorstellungTP">Mail nach Vorstellung TP</a></li>
</ul>
</li>
<li><a href="#AkquisePartnerfirmen-AntwortenzuAufschiebung">Antworten zu Aufschiebung</a></li>
<li><a href="#AkquisePartnerfirmen-AntwortenzuAbsagen">Antworten zu Absagen</a>
<ul class="toc-indentation">
<li><a href="#AkquisePartnerfirmen-AbsagewegenNiveauderJuniorsbzw.zuvielEinarbeitung">Absage wegen Niveau der Juniors bzw. zu viel Einarbeitung</a></li>
<li><a href="#AkquisePartnerfirmen-Absagewegen„keinBudget“=>emailanCEO">Absage wegen &bdquo;kein Budget&ldquo; =&gt; email an CEO</a></li>
<li><a href="#AkquisePartnerfirmen-Absagewegen„zuteuer,lieberFestanstellungen“">Absage wegen &bdquo;zu teuer, lieber Festanstellungen&ldquo;</a></li>
</ul>
</li>
</ul>
</div><h1 id="AkquisePartnerfirmen-VorgehenfürdieKaltakquise">Vorgehen f&uuml;r die Kaltakquise</h1><p>Dieses Dokument gibt die &Uuml;berlegungen wieder, wie man am besten zu einem Vorstellungstermin f&uuml;r den Cudos Trail von potentiellen Partnerfirmen kommen kann.</p><h2 id="AkquisePartnerfirmen-QuellenfürpotentiellePartnerfirmen">Quellen f&uuml;r potentielle Partnerfirmen</h2><ul><li><p>CRM: Klassifizierung Trainee-Programm auf &ldquo;abkl&auml;ren&rdquo;</p></li><li><p><a class="external-link" data-card-appearance="inline" href="https://www.swissmadesoftware.org/praktika-und-diplomarbeiten.html" rel="nofollow">https://www.swissmadesoftware.org/praktika-und-diplomarbeiten.html</a> </p></li><li><p><a class="external-link" data-card-appearance="inline" href="https://swissdevjobs.ch/" rel="nofollow">https://swissdevjobs.ch/</a> </p></li><li><p><a class="external-link" data-card-appearance="inline" href="https://software-job.ch/" rel="nofollow">https://software-job.ch/</a> </p></li><li><p><a class="external-link" data-card-appearance="inline" href="https://www.ostjob.ch/" rel="nofollow">https://www.ostjob.ch/</a> </p></li></ul><h2 id="AkquisePartnerfirmen-Vorbereitung">Vorbereitung</h2><ul class="inline-task-list" data-inline-tasks-content-id="5696554503"><li data-inline-task-id="4"><span class="placeholder-inline-tasks">CRM checken, ob es schon Kontakte oder Potentiale gab</span></li><li data-inline-task-id="5"><span class="placeholder-inline-tasks">Kurze Firmenanalyse und Stelleninserate anschauen</span></li><li data-inline-task-id="6"><span class="placeholder-inline-tasks">Argumentationen vorbereiten</span></li></ul><h1 id="AkquisePartnerfirmen-Textvorlagen">Textvorlagen</h1><h2 id="AkquisePartnerfirmen-Mailtext(JuniorschlägtPartnerfirmavor)">Mailtext (Junior schl&auml;gt Partnerfirma vor)</h2><p>Haben Sie schon mal von unserem&nbsp;<a class="external-link" href="https://cudos.ch/de/trail-partner-werden/" rel="nofollow">Cross-Company-Programm f&uuml;r Software Engineers</a>&nbsp;geh&ouml;rt?&nbsp;</p><p>Ein Junior von uns (Name) ist auf Ihre ausgeschriebene Stelle als XY (Link)&nbsp;aufmerksam geworden und ist der Meinung, dass sich Ihr Unternehmen ausgezeichnet f&uuml;r einen Einsatz im Rahmen des Cross-Company Programm eignet. Zudem passen seine Technologie-Kenntnisse sehr gut zum Stelleninserat.</p><p>Kurz zusammengefasst: Das Ziel des Cudos Trails ist es, junge, motivierte Software-Ingenieure und innovative Technologie-Firmen zusammenzubringen. Dabei rotiert der Junior w&auml;hrend drei Jahren im Netzwerk und arbeitet jeweils 6-12 Monate bei einer Partnerfirma im Software-Team vor Ort mit. Parallel dazu wird&nbsp;er mittels monatlichen Workshops und Mentoring zu einem erfahrenen Software-Engineer ausgebildet.</p><p>Sie als Partnerfirma k&ouml;nnen so risikolos und ohne grossen Rekrutierungs- und Betreuungsaufwand engagierte Software-Engineers gewinnen. Wenn Sie von einem Trainee &uuml;berzeugt sind, k&ouml;nnen Sie ihm nach Abschluss des Cross-Company Programm eine Festanstellung anbieten. So k&ouml;nnen Sie kurzfristig Ihr Team entlasten und langfristig neue, gut ausgebildete Engineers f&uuml;r sich gewinnen, die zu Ihrer Firma passen.</p><p>Sind Sie auf der Suche nach jungen, kompetenten und engagierten Software-Ingenieuren? Gerne komme ich bei Ihnen vorbei und stelle das Cross-Company Programm pers&ouml;nlich w&auml;hrend ca. 30 Minuten vor. Dabei erkl&auml;re ich das Konzept und bringe Ihnen Profile der passenden Juniors mit. Wann darf ich vorbeikommen? Ich freue mich, von Ihnen zu h&ouml;ren.<br />Beste Gr&uuml;sse</p><h2 id="AkquisePartnerfirmen-Mailtext(JuniorwirbtdirektbeiFirma)">Mailtext (Junior wirbt direkt bei Firma)</h2><p>Sehr geehrte(r)&nbsp; Herr/Frau &hellip; XX</p><p>Ich melde mich bei Ihnen bez&uuml;glich ihres Stelleninserats f&uuml;r XX. Ich arbeite zurzeit als Software Ingenieur im Cross-Company-Programm der Cudos AG (mehr Details unter <a class="external-link" href="https://cudos.ch/de/trail-partner-werden/" rel="nofollow">Cross-Company-Programm</a>). Das Ziel dieses Programms ist es, junge motivierte Software Ingenieure wie mich und innovative Technologie-Firmen wie Sie zusammen zu bringen. Als Junior habe ich die M&ouml;glichkeit, in 3 Jahren drei bis f&uuml;nf Eins&auml;tze bei verschiedenen Partnerfirmen zu absolvieren und jeweils 6-12 Monate bei einer Partnerfirma im Software-Team vor Ort mitzuarbeiten.</p><p>Sie als Partnerfirma k&ouml;nnen so risikolos und ohne grossen Rekrutierungs- und Betreuungsaufwand einen engagierten Software Ingenieur gewinnen. Wenn Sie nach meinem Einsatz bei Ihnen immer noch &uuml;berzeugt von mir sind, k&ouml;nnen Sie mir eine Festanstellung anbieten.</p><p>Ihr Inserat klingt sehr interessant und ich denke, Sie w&uuml;rden als Partnerfirma gut ins Programm passen. Deshalb wollte ich mich erkundigen, ob Sie es sich vorstellen k&ouml;nnten, dem Cross-Company Programm als Partnerfirma beizutreten und auf diese Weise kompetente und engagierte Arbeitskr&auml;fte wie mich zu gewinnen.</p><p>Falls ich Ihr Interesse geweckt habe, w&uuml;rde ich Sie gerne pers&ouml;nlich kennen lernen und Ihnen das Cross-Company Programm noch genauer erl&auml;utern. Ich w&uuml;rde mich &uuml;ber eine m&ouml;gliche Zusammenarbeit sehr freuen und stehe bei Fragen nat&uuml;rlich gerne zur Verf&uuml;gung.</p><p>Freundliche Gr&uuml;sse</p><p>XX</p><p><br /><strong>Beispiel Englisch:</strong></p><p>Dear Mr. Bozyigit</p><p>I contact you regarding the job offer as a software developer for Battrion (<a class="external-link" href="http://www.battrion.com/wp-content/uploads/200203_SoftwareDeveloper_rev003.pdf" rel="nofollow"><span data-colorid="r3ag1194ay"><u>http://www.battrion.com/wp-content/uploads/200203_SoftwareDeveloper_rev003.pdf</u></span></a>). Currently I work as a software engineer in the Cross-Company Program of Cudos AG (more information under <a class="external-link" href="https://cudos.ch/de/trail-partner-werden/" rel="nofollow"><span data-colorid="y6erjgb6ak"><u>Cross-Company Programm</u></span></a>). The aim of the program is to bring young and motivated software developers like me together with innovative technology companies like Battrion. As a Junior I get a chance to work within three to six different partner companies for a total of 3 Years.</p><p>Battrion as a partner company can win over dedicated programmers without major recruitment and supervision effort at zero risk. If you still feel confident after my work assignment, I would be happy to be offered a permanent job.</p><p>Your job advertisement sounds very interesting and Battrion would fit perfectly into our network of partner companies. I contact you to assess whether you are interested in joining the Cross-Company Program to meet engaged software engineers like me.</p><p>In my first assignment as trainee I worked in a small and agile team to develop a testing-framework for X-ray-detectors at Decrtis AG. This pytest-based software in which&rsquo;s development I was involved from the ground up is nowadays used for calibration and quality assurance of the newest detector generation. High importance was attached to maintainable and reliable code as well as knowledge transfer. Accordingly, I already acquired may useful skills regarding your job offer and I would be very interested in working for you.</p><p>If I caught your attention, I would be pleased to meet with you in person to introduce myself and the Cross-Company Program in more detail. I would be honored about a future collaboration and I am of course available for questions.</p><p>Sincerely yours,<br />Fabio Wanner</p><h2 id="AkquisePartnerfirmen-Mailtext-ErstkontaktV1(mitCalendly)">Mailtext - Erstkontakt V1 (mit Calendly)</h2><p>Guten Tag / Gr&uuml;ezi Herr XY,</p><p>Wir&nbsp;sind ein Netzwerk von &uuml;ber 20&nbsp;Firmen und haben ein schweizweit-einzigartiges <a class="external-link" href="https://cudos.ch/de/trail-partner-werden/" rel="nofollow">Cross-Company-Programm</a>. Ganz nach dem &ldquo;try und hire&rdquo;-Prinzip k&ouml;nnen Sie talentierte Software Engineers mit Hochschulabschluss und mindestens 3 Jahren Berufserfahrung f&uuml;r Ihr Team gewinnen - und das ohne Rekrutierungsaufwand.</p><p>M&ouml;chten Sie mehr dar&uuml;ber erfahren? Gerne stelle ich Ihnen das Programm vor. 20-30 Minuten sollten reichen, um Ihnen das Konzept zu erkl&auml;ren und zu schauen, ob&nbsp;es&nbsp;f&uuml;r Sie und Ihr Team passen k&ouml;nnte.&nbsp;Hier sehen Sie meine Verf&uuml;gbarkeiten und k&ouml;nnen direkt einen Teams-Call buchen: <a class="external-link" data-card-appearance="inline" href="https://calendly.com/rachel-blaser/vorstellung-cross-company-programm" rel="nofollow">https://calendly.com/rachel-blaser/vorstellung-cross-company-programm</a> </p><p>Ich freue mich, von Ihnen zu h&ouml;ren und w&uuml;nsche Ihnen einen sch&ouml;nen Tag!</p><p>Beste Gr&uuml;sse</p><h2 id="AkquisePartnerfirmen-Mailtext-ErstkontaktV2(mitNutzenalsBulletpoints)">Mailtext - Erstkontakt V2 (mit Nutzen als Bulletpoints)</h2><p>Suchen Sie ebenfalls junge, engagierte Software Ingenieure mit&nbsp;3-4 Jahren Erfahrung?&nbsp;</p><p>Wir - die Partnerfirmen vom schweizweit-einzigartigen <a class="external-link" href="https://cudos.ch/de/trail-partner-werden/" rel="nofollow">Cross-Company-Programm</a> - sind ein Netzwerk von 20 Firmen, welches gemeinsam die besten Absolventen rekrutiert, weiterbildet und sie mit anspruchsvollen Softwareprojekten herausfordert. So k&ouml;nnen wir unser Nachwuchsproblem l&ouml;sen und kriegen regelm&auml;ssig neue Inputs zu unseren Softwareprozessen. Werden auch Sie Teil vom Netzwerk und profitieren Sie von folgenden Vorteilen:</p><p>►&nbsp;&nbsp; Neues Know-how und engagierte Software-Ingenieure im eigenen Team</p><p>►&nbsp;&nbsp; Zugang zu Top-Talenten mit M&ouml;glichkeit zur Festanstellung</p><p>►&nbsp;&nbsp; Betreuung und Weiterbildung sind garantiert abgedeckt</p><p>►&nbsp;&nbsp; Der ganze Rekrutierungsaufwand f&auml;llt weg</p><p>►&nbsp;&nbsp; Kein Risiko bei neuen Software-Mitarbeitern - Sie stellen nur Mitarbeiter ein, die sich bereits bei Ihnen bew&auml;hrt haben&nbsp; &nbsp;&nbsp;</p><p>Gerne w&uuml;rde ich bei Ihnen vorbeikommen und das Cross-Company-Programm kurz vorstellen. 30 Minuten sollten reichen, um Ihnen das Konzept zu erkl&auml;ren, unsere Trainees vorzustellen und mit Ihnen dar&uuml;ber zu diskutieren. Wann h&auml;tten Sie Zeit?</p><p>Ich freue mich, von Ihnen zu h&ouml;ren.</p><p>Beste Gr&uuml;sse<br /></p><h2 id="AkquisePartnerfirmen-Mailtext-ErstkontaktV3(ProblemFachkräftemangel)">Mailtext - Erstkontakt V3 (Problem Fachkr&auml;ftemangel)</h2><p>Sehr geehrter Herr M&uuml;ller,</p><p>Haben Sie in den letzten Jahren auch schon einen guten Software-Ingenieur mit einigen Jahren Erfahrung gesucht? Wenn Sie &ndash; so wie wir &ndash; auch die Erfahrung gemacht haben, dass das gar nicht so einfach ist, w&uuml;rden wir gerne mit Ihnen &uuml;ber unser Cross-Company-Programm sprechen.</p><p>Cudos hat vor zehn Jahren ein Konzept entwickelt, wie Sie ab jetzt top ausgebildete, erfahrene Software-Ingenieure einstellen k&ouml;nnen &ndash; allerdings m&uuml;ssen Sie uns dabei helfen, diese auszubilden!</p><p>Gerne w&uuml;rde ich bei Ihnen vorbei kommen und das Cross-Company-Programm kurz vorstellen. 30 Minuten sollten reichen, um Ihnen das Konzept zu erkl&auml;ren, die Juniors vorzustellen und mit Ihnen dar&uuml;ber zu diskutieren. Wann h&auml;tten Sie Zeit?</p><p>Ich freue mich, von Ihnen zu h&ouml;ren.</p><p>Beste Gr&uuml;sse</p><p /><h2 id="AkquisePartnerfirmen-Mailtext-ErstkontaktV4(Englisch)">Mailtext - Erstkontakt V4 (Englisch)</h2><p>​Dear Mr. Fabre</p><p>Are you also looking for a good software engineer with some years of professional experience? If you - like us - have also made the experience that this is not so easy, we would like to talk to you about our cross-company Program.<br /><br />Seven years ago, Cudos developed a concept of how you can hire top trained, experienced software engineers from now on - but you have to help us to train them! I would like to come by and give you a brief introduction to the cross company program. 30 minutes should be enough to explain the concept to you, introduce the juniors and discuss it with you. When would you have time?<br /><br />I look forward to hearing from you.<br /><br />Best regards</p><p /><h2 id="AkquisePartnerfirmen-Mailtext-ErstkontaktV4(nachEmpfehlungundAnruf-nichterreicht)">Mailtext - Erstkontakt V4 (nach Empfehlung und Anruf - nicht erreicht)</h2><p>Sehr geehrter Herr Frei</p><p>Leider konnte ich Sie telefonisch nicht erreichen. Ihr Kollege Stephan Ghirlanda hat mich gebeten mit Ihnen Kontakt aufzunehmen zum Thema Personalengp&auml;sse in der Entwicklung. Wir haben seit einigen Jahren ein Partnerfirmennetzwerk aufgebaut, um gemeinsam junge, top-motivierte SW-Ingenieure zu rekrutieren. Rufen Sie mich doch bitte kurz zur&uuml;ck, dann kann ich Ihnen unser Konzept kurz erkl&auml;ren.</p><p>Vielen Dank.</p><p>Freundliche Gr&uuml;sse</p><p /><h2 id="AkquisePartnerfirmen-Mailtext–ZweitkontaktV1(nachJobmesse)">Mailtext &ndash; Zweitkontakt V1 (nach Jobmesse)</h2><p>Guten Tag Herr XY</p><p>Wir hatten uns am Career Day 2017 der BFH getroffen und &uuml;ber unser &nbsp;<a class="external-link" href="https://cudos.ch/de/trail-partner-werden/" rel="nofollow">Cross-Company-Programm</a>&nbsp;gesprochen - m&ouml;gen Sie sich erinnern? In der Zwischenzeit ist das Cudos Trail stark gewachsen und besch&auml;ftigt mittlerweile 12 Trainees, welche alle bei diversen Partnerfirmen in den Software Teams vor Ort mitarbeiten.&nbsp;</p><p>Nun bin ich per Zufall wieder &uuml;ber Ihre Firma gestossen. Wie l&auml;uft es bei Ihnen? Sind Sie nach wie vor auf der Suche nach jungen Software-Ingenieuren?</p><p>Falls ja, w&uuml;rde ich gerne mal bei Ihnen vorbei kommen und das Cross-Company-Programm kurz vorstellen. 30 Minuten sollten reichen, um Ihnen das Konzept zu erkl&auml;ren und mit Ihnen dar&uuml;ber zu diskutieren. Wann h&auml;tten Sie Zeit?</p><p>Ich freue mich, von Ihnen zu h&ouml;ren.</p><p>Beste Gr&uuml;sse</p><h2 id="AkquisePartnerfirmen-Mailtext–ZweitkontaktV2(nachvielenJahren)">Mailtext &ndash; Zweitkontakt V2 (nach vielen Jahren)</h2><p>Guten Tag Herr Robert,</p><p>Ich bin soeben auf Ihre ausgeschriebene Stelle &quot;Applikationsentwickler&quot; gestossen und dachte mir, diese Stelle passt perfekt zu unseren Juniors. M&ouml;gen Sie sich noch an unser&nbsp;<a class="external-link" href="https://cudos.ch/de/trail-partner-werden/" rel="nofollow">Cross-Company-Programm</a>&nbsp;erinnern, wor&uuml;ber Sie vor einiger Zeit mit Reto B&auml;ttig (unserem CEO) gesprochen haben?&nbsp;</p><p>Nun in der Zwischenzeit ist das Cross-Company-Programm stark gewachsen und besch&auml;ftigt mittlerweile 12 Juniors, welche alle bei diversen Partnerfirmen in den Software Teams vor Ort mitarbeiten.</p><p>Gerne w&uuml;rde ich diese Gelegenheit nutzen und bei Ihnen kurz vorbei kommen.&nbsp;30 Minuten sollten reichen, um Ihnen das Konzept und unsere Juniors pers&ouml;nlich vorzustellen und mit Ihnen dar&uuml;ber zu diskutieren.</p><p>Ich w&uuml;rde mich freuen, von Ihnen zu h&ouml;ren.</p><p>Beste Gr&uuml;sse<br /></p><h1 id="AkquisePartnerfirmen-FragenfürsersteTelefongespräch">Fragen f&uuml;rs erste Telefongespr&auml;ch</h1><ul><li><p>Haben Sie die Informationen erhalten?&nbsp;</p></li><li><p>Sind auch Sie immer wieder auf der Suche nach jungen SW Ingenieure? / Wie sieht&rsquo;s dann momentan bei Ihnen aus?</p></li><li><p>D&uuml;rfte ich (zusammen mit dem Junior) vorbei kommen? Wann h&auml;tten Sie Zeit? Ideal w&auml;re der &hellip;.</p></li><li><p>Ich w&uuml;rde Ihnen sonst vorab das Profil des aktuellen Juniors XY schicken.</p></li><li><p>Wer sind bei Ihnen die richtigen Leute f&uuml;r die Vorstellung?</p></li><li><p>Kein Bedarf/Zeit &rarr; Kein Problem, d&uuml;rfte ich mich wieder bei Ihnen melden?</p></li><li><p>Wie sollen wir verbleiben?</p></li><li><p>Wer k&ouml;nnte es intern noch interessieren?<br /></p></li></ul><p><strong>Kurzfassung CT</strong>:</p><p>In unserem Cross-Company-Programm geht es darum, dass junge SW-Ingenieure w&auml;hrend 3 Jahren Erfahrungen in verschiedenen Partnerfirmen sammeln k&ouml;nnen und am Schluss idealerweise von einer dieser Firmen fest angestellt werden.</p><p>Wir &uuml;bernehmen dabei die ganze Betreuung, das Coaching und die Weiterbildung, sodass unsere Partnerfirmen die Trainees voll einsetzen k&ouml;nnen.</p><p>oder:</p><p>Kurz zusammengefasst: Das Ziel des <a class="external-link" href="https://cudos.ch/de/trail-partner-werden/" rel="nofollow">Cross-Company-Programm</a> ist es, junge motivierte Software Ingenieure und innovative Technologie-Firmen zusammen zu bringen. Der Junior hat die M&ouml;glichkeit, in 3 Jahren drei bis f&uuml;nf Eins&auml;tze bei verschiedenen Partnerfirmen zu absolvieren und jeweils 6-12 Monate bei einer Partnerfirma im Software-Team vor Ort mitzuarbeiten.</p><p>Sie als Partnerfirma k&ouml;nnen so risikolos und ohne grossen Rekrutierungs- und Betreuungsaufwand einen engagierten Software Ingenieur gewinnen. Wenn Sie nach einem Einsatz bei Ihnen immer noch &uuml;berzeugt vom Junior sind, k&ouml;nnen Sie ihm eine Festanstellung anbieten. So k&ouml;nnen Sie kurzfristig das Team entlasten und langfristig neue Ingenieure gewinnen.<br /></p><h2 id="AkquisePartnerfirmen-MailnachVorstellungTP">Mail nach Vorstellung TP</h2><p>Lieber XY</p><p>Herzlichen Dank nochmals f&uuml;r den freundlichen Empfang und das offene Gespr&auml;ch vorhin. Wie versprochen sende ich euch anbei die Pr&auml;sentation sowie auch die Vorlage vom Rahmenvertrag. Solltet irgendwelche Fragen auftauchen oder m&ouml;chtet ihr mehr &uuml;ber einen Junior erfahren, dann meldet euch bei mir. Ich habe das Gef&uuml;hl, XY w&auml;re eine spannende Erg&auml;nzung im Partnerfirmennetzwerk und eine &auml;usserst attraktive Firma f&uuml;r unsere Juniors.</p><p>Ich freue mich, wieder von euch zu h&ouml;ren.</p><p>Beste Gr&uuml;sse Rachel</p><hr /><p>Sehr geehrter Herr XY<br />Vielen Dank f&uuml;r das offene Gespr&auml;ch und die Vorstellung von XY. Ich konnte mir einen guten Eindruck von der Firma machen und denke, dass Sie als Partnerfirma f&uuml;r unsere Trainees interessant w&auml;ren und auch gut ins Netzwerk passen w&uuml;rden.&nbsp;</p><p>Wie versprochen, sende ich Ihnen anbei die Pr&auml;sentation sowie die Profile der aktuell verf&uuml;gbaren Juniors. Wie erw&auml;hnt, w&uuml;rde bspw. XY sehr gut zu Ihnen passen, da .... Melden Sie sich bei mir, falls Bedarf besteht und Sie mal einer der Juniors kennen lernen m&ouml;chten.</p><p>(Falls Ihrerseits Interesse an unseren&nbsp;<a class="external-link" href="https://www.m-f.ch/pruefsysteme" rel="nofollow">Pr&uuml;fsystem&nbsp;bzw. Testing-Dienstleistungen</a>&nbsp;besteht, d&uuml;rfen Sie auch gerne direkt mit unserem Leiter Pr&uuml;fsystem Bruno Kn&ouml;pfel Kontakt aufnehmen (im CC). Falls Sie Fragen zu unseren&nbsp;<a class="external-link" href="https://www.m-f.ch/software-engineering/individualsoftware" rel="nofollow">Software-Dienstleistungen</a>&nbsp;allgemein haben, ist Reto B&auml;ttig die richtige Ansprechperson.)</p><p>Wenn noch irgendwelche Fragen auftauchen, bin ich gerne f&uuml;r Sie da.<br /><br />Ich freue mich, von Ihnen zu h&ouml;ren.<br />Beste Gr&uuml;sse</p><p><strong>&nbsp;</strong></p><h1 id="AkquisePartnerfirmen-AntwortenzuAufschiebung">Antworten zu Aufschiebung</h1><p>Sehr geehrter Herr &hellip;</p><p>Vielen Dank Ihre R&uuml;ckmeldung. Leider konnte ich Sie telefonisch nicht erreichen.</p><p>Ich wollte kurz nachfragen, was es denn braucht, um einen Schritt weiter zu kommen bzw. einen konkreten Junior mal anzuschauen?&nbsp;<br />K&ouml;nnte man nicht einfach Ihren gewohnten Bewerbungsprozess mit einem der Beiden durchf&uuml;hren und mal ein Vorstellungsgespr&auml;ch bei&nbsp;einem Teamleiter organisieren? Sie haben ja momentan passende Stellen ausgeschrieben.</p><p>Ich finde es immer etwas schade, wenn das Thema aus Zeitgr&uuml;nden weiter vertagt wird. Denn f&uuml;r Sie als Partnerfirma ist der Aufwand eigentlich noch kleiner als bei einer &quot;normalen&quot; Bewerbung, da wir ja bereits die Vorselektion und Qualit&auml;tspr&uuml;fung gemacht haben. Was genau spricht momentan gegen ein Kennenlernen?</p><p>Gerne k&ouml;nnen Sie mich auch kurz zur&uuml;ckrufen.</p><p>Besten Dank und Freundliche Gr&uuml;sse<br /></p><h1 id="AkquisePartnerfirmen-AntwortenzuAbsagen">Antworten zu Absagen</h1><h3 id="AkquisePartnerfirmen-AbsagewegenNiveauderJuniorsbzw.zuvielEinarbeitung">Absage wegen Niveau der Juniors bzw. zu viel Einarbeitung</h3><p>Hoi XY,</p><p>Schade, dass es nicht passt, aber vielen Dank f&uuml;r deine R&uuml;ckmeldung.&nbsp;</p><p>Nur, dass du es nicht falsch verstehst... Es ginge nicht um ein Praktikum, sondern um einen Junior-Einsatz mit M&ouml;glichkeit zur Festanstellung (try and hire). Das heisst, der Trainee arbeitet w&auml;hrend des Einsatzes von Anfang an produktiv im Team mit. Da wir von 200 Bewerbungen pro Jahr 5-7 Trainees einstellen, ist das Niveau der Auffassungsgabe und die Motivation, Neues zu lernen, sehr hoch. Deshalb geht es auch darum, dass der Junior in jedem Einsatz neue Technologien und Vorgehensweisen&nbsp;lernt und nicht schon alles kann. ;-)</p><p>Wenn du Fragen dazu hast oder doch interessiert bist, melde dich einfach bei mir.&nbsp;</p><p>Liebe Gr&uuml;sse Rachel</p><p /><h3 id="AkquisePartnerfirmen-Absagewegen„keinBudget“=>emailanCEO">Absage wegen &bdquo;kein Budget&ldquo; =&gt; email an CEO</h3><p>Optimierungspotential bei Herrn &hellip;.</p><p>Sehr geehrter Herr &hellip;</p><p>Leider hat sich in ihrer Firma gerade folgendes Szenario abgespielt:</p><ul><li><p>Jemand hat eine gute Idee gehabt. Er ist sicher, dass diese Idee&hellip;</p><ol start="1"><li><p>&hellip;ihm ein dringendes Problem l&ouml;st</p></li><li><p>&hellip;der Firma mittelfristig zu mehr Gewinn und besseren Mitarbeitern verhilft</p></li></ol></li><li><p>Diese Person hat einen Antrag an seinen Vorgesetzten gemacht, um diese Idee Umsetzen zu k&ouml;nnen</p></li><li><p>Der Vorgesetzte hat abgelehnt mit der Begr&uuml;ndung: &bdquo;Wir haben kein Budget daf&uuml;r&ldquo;</p></li><li><p>Dadurch, dass das Problem jetzt nicht gel&ouml;st ist, gibt die Firma nun zwar kein Geld aus, das nicht im Budget ist, daf&uuml;r werden Projekte verz&ouml;gert, was die viel gr&ouml;sseren Folgekosten ausl&ouml;st. &egrave; SIE VERLIEREN GELD!!!</p></li></ul><p>Falls Sie das Geld nicht verlieren m&ouml;chten, kann ich ihnen gerne &uuml;ber den konkreten Fall Auskunft geben oder noch besser: Sie informieren sich bei ihrem Mitarbeiter &hellip;&hellip;&hellip;&hellip; und lassen sich erkl&auml;ren, weshalb er findet, dass ihre Firma am Nachwuchsf&ouml;rderungsprogramm der Cudos AG teilnehmen sollte.</p><p>Mit freundlichen Gr&uuml;ssen</p><p>Reto B&auml;ttig</p><p /><h3 id="AkquisePartnerfirmen-Absagewegen„zuteuer,lieberFestanstellungen“">Absage wegen &bdquo;zu teuer, lieber Festanstellungen&ldquo;</h3><p>Guten Morgen Herr Perrenoud</p><p>Vielen Dank f&uuml;r die Antwort.</p><p>Die Argumente h&ouml;re ich nicht zum ersten Mal. K&ouml;nnte es sein, dass sie &Auml;pfel mit Birnen vergleichen? Ihre Argumente stimmen nur unter der Voraussetzung, dass sie gute feste Mitarbeiter finden, die sie einstellen k&ouml;nnen.</p><p>Unser Programm geht ja gerade davon aus, dass sie zu wenige von diesen finden und bietet ihnen eine Quelle von top ausgebildeten neuen Mitarbeitern.</p><p>Spielen Sie im Kopf mal das Szenario durch, dass sie eben zu wenige gute Bewerbungen kriegen. Ihnen bleibt also nur die Alternative, entweder ihre Projekte langsamer voran zu treiben, oder externe Unterst&uuml;tzung in Betracht zu ziehen. Jetzt vergleichen sie bitte ihre Argumente mit der Alternative, einen &quot;normalen&quot; externen Mitarbeiter f&uuml;r ein Projekt f&uuml;r 6-12 Monate hinzu zu ziehen:</p><p>- Was bezahlen sie f&uuml;r eine Junior-Ressource ohne Qualit&auml;tsgarantie (unsere Juniors sind streng aussortiert und geh&ouml;ren zu den Besten ihrer Jahrg&auml;nge)?</p><p>- Haben sie bei einer Junior-Ressource von einem anderen Dienstleister ebenfalls ein Coaching-Programm und ein Risikomanagement inkl. Qualit&auml;tssicherung inbegriffen?</p><p>- K&ouml;nnen sie die Junior-Ressource eines anderen Dienstleisters problemlos abwerben?</p><p>Ich bin gespannt auf ihre Antwort. Falls sie kein Ressourcenproblem haben und immer in gen&uuml;gender Menge gute neue Mitarbeiter finden, gebe ich sofort auf ;-)</p><p>Freundliche Gr&uuml;sse und einen sch&ouml;nen Tag,</p><p>Reto B&auml;ttig</p><p><br /></p><p><strong>Vorteile gegen&uuml;ber der sofortigen Festeinstellung von Studienabg&auml;ngern:</strong><br />- Betreuung durch Mentoren wird erleichtert und verbessert<br />- Langfristige L&ouml;sung. Ein Studienabg&auml;nger k&uuml;ndigt nach 3-4 Jahren. Wenn er sich aber nach dem CT f&uuml;r eine Firma entscheidet, ist das l&auml;ngerfristig<br />- Weiterbildung durch monatliche Workshops und Seminare</p><p>Man kriegt einfach unter dem Strich viel bessere Leute und l&ouml;st viele Probleme!&nbsp;Wir selbst stellen ja auch keine Studienabg&auml;nger mehr ein f&uuml;r's Engineering, sondern erst, nachdem sie das CT durchlaufen haben!</p><p><br /></p><p><br /></p>
                    </div>

                    
                                                      
                </div>             </div> 
            <div id="footer" role="contentinfo">
                <section class="footer-body">
                    <p>Document generated by Confluence on Okt. 15, 2024 12:04</p>
                    <div id="footer-logo"><a href="http://www.atlassian.com/">Atlassian</a></div>
                </section>
            </div>
        </div>     </body>
</html>
